Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x7c0 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x4c9bf): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x4a7c0): ../Core/Src/main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xca7): E:/Projects/Software/STM32/Lecture1/STM32_GPIO/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x60f91): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x7b41): __uint8_t
    <35>   DW_AT_decl_file   : 3
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0x5cfa3): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x5123): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0x69041): __uint16_t
    <4f>   DW_AT_decl_file   : 3
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0x41202): short unsigned int
 <1><5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 5	(signed)
    <60>   DW_AT_name        : (indirect string, offset: 0x1a077): long int
 <1><64>: Abbrev Number: 3 (DW_TAG_typedef)
    <65>   DW_AT_name        : (indirect string, offset: 0x38f02): __uint32_t
    <69>   DW_AT_decl_file   : 3
    <6a>   DW_AT_decl_line   : 79
    <6b>   DW_AT_decl_column : 25
    <6c>   DW_AT_type        : <0x70>
 <1><70>: Abbrev Number: 2 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 4
    <72>   DW_AT_encoding    : 7	(unsigned)
    <73>   DW_AT_name        : (indirect string, offset: 0x4c75d): long unsigned int
 <1><77>: Abbrev Number: 2 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 8
    <79>   DW_AT_encoding    : 5	(signed)
    <7a>   DW_AT_name        : (indirect string, offset: 0x338b6): long long int
 <1><7e>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f>   DW_AT_byte_size   : 8
    <80>   DW_AT_encoding    : 7	(unsigned)
    <81>   DW_AT_name        : (indirect string, offset: 0x2c0fa): long long unsigned int
 <1><85>: Abbrev Number: 4 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : int
 <1><8c>: Abbrev Number: 2 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x462ef): unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_typedef)
    <94>   DW_AT_name        : (indirect string, offset: 0x7b43): uint8_t
    <98>   DW_AT_decl_file   : 4
    <99>   DW_AT_decl_line   : 24
    <9a>   DW_AT_decl_column : 19
    <9b>   DW_AT_type        : <0x30>
 <1><9f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0>   DW_AT_name        : (indirect string, offset: 0x69043): uint16_t
    <a4>   DW_AT_decl_file   : 4
    <a5>   DW_AT_decl_line   : 36
    <a6>   DW_AT_decl_column : 20
    <a7>   DW_AT_type        : <0x4a>
 <1><ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac>   DW_AT_name        : (indirect string, offset: 0x38f04): uint32_t
    <b0>   DW_AT_decl_file   : 4
    <b1>   DW_AT_decl_line   : 48
    <b2>   DW_AT_decl_column : 20
    <b3>   DW_AT_type        : <0x64>
 <1><b7>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b8>   DW_AT_type        : <0xab>
 <1><bc>: Abbrev Number: 6 (DW_TAG_array_type)
    <bd>   DW_AT_type        : <0xab>
    <c1>   DW_AT_sibling     : <0xcc>
 <2><c5>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c6>   DW_AT_type        : <0x8c>
    <ca>   DW_AT_upper_bound : 0
 <2><cb>: Abbrev Number: 0
 <1><cc>: Abbrev Number: 6 (DW_TAG_array_type)
    <cd>   DW_AT_type        : <0xab>
    <d1>   DW_AT_sibling     : <0xdc>
 <2><d5>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <d6>   DW_AT_type        : <0x8c>
    <da>   DW_AT_upper_bound : 1
 <2><db>: Abbrev Number: 0
 <1><dc>: Abbrev Number: 8 (DW_TAG_structure_type)
    <dd>   DW_AT_byte_size   : 40
    <de>   DW_AT_decl_file   : 5
    <df>   DW_AT_decl_line   : 265
    <e1>   DW_AT_decl_column : 9
    <e2>   DW_AT_sibling     : <0x165>
 <2><e6>: Abbrev Number: 9 (DW_TAG_member)
    <e7>   DW_AT_name        : (indirect string, offset: 0x620f1): MODER
    <eb>   DW_AT_decl_file   : 5
    <ec>   DW_AT_decl_line   : 267
    <ee>   DW_AT_decl_column : 17
    <ef>   DW_AT_type        : <0xb7>
    <f3>   DW_AT_data_member_location: 0
 <2><f4>: Abbrev Number: 9 (DW_TAG_member)
    <f5>   DW_AT_name        : (indirect string, offset: 0x33e0a): OTYPER
    <f9>   DW_AT_decl_file   : 5
    <fa>   DW_AT_decl_line   : 268
    <fc>   DW_AT_decl_column : 17
    <fd>   DW_AT_type        : <0xb7>
    <101>   DW_AT_data_member_location: 4
 <2><102>: Abbrev Number: 9 (DW_TAG_member)
    <103>   DW_AT_name        : (indirect string, offset: 0x292a1): OSPEEDR
    <107>   DW_AT_decl_file   : 5
    <108>   DW_AT_decl_line   : 269
    <10a>   DW_AT_decl_column : 17
    <10b>   DW_AT_type        : <0xb7>
    <10f>   DW_AT_data_member_location: 8
 <2><110>: Abbrev Number: 9 (DW_TAG_member)
    <111>   DW_AT_name        : (indirect string, offset: 0x80f00): PUPDR
    <115>   DW_AT_decl_file   : 5
    <116>   DW_AT_decl_line   : 270
    <118>   DW_AT_decl_column : 17
    <119>   DW_AT_type        : <0xb7>
    <11d>   DW_AT_data_member_location: 12
 <2><11e>: Abbrev Number: 10 (DW_TAG_member)
    <11f>   DW_AT_name        : IDR
    <123>   DW_AT_decl_file   : 5
    <124>   DW_AT_decl_line   : 271
    <126>   DW_AT_decl_column : 17
    <127>   DW_AT_type        : <0xb7>
    <12b>   DW_AT_data_member_location: 16
 <2><12c>: Abbrev Number: 10 (DW_TAG_member)
    <12d>   DW_AT_name        : ODR
    <131>   DW_AT_decl_file   : 5
    <132>   DW_AT_decl_line   : 272
    <134>   DW_AT_decl_column : 17
    <135>   DW_AT_type        : <0xb7>
    <139>   DW_AT_data_member_location: 20
 <2><13a>: Abbrev Number: 9 (DW_TAG_member)
    <13b>   DW_AT_name        : (indirect string, offset: 0x5b71e): BSRR
    <13f>   DW_AT_decl_file   : 5
    <140>   DW_AT_decl_line   : 273
    <142>   DW_AT_decl_column : 17
    <143>   DW_AT_type        : <0xb7>
    <147>   DW_AT_data_member_location: 24
 <2><148>: Abbrev Number: 9 (DW_TAG_member)
    <149>   DW_AT_name        : (indirect string, offset: 0x2283b): LCKR
    <14d>   DW_AT_decl_file   : 5
    <14e>   DW_AT_decl_line   : 274
    <150>   DW_AT_decl_column : 17
    <151>   DW_AT_type        : <0xb7>
    <155>   DW_AT_data_member_location: 28
 <2><156>: Abbrev Number: 10 (DW_TAG_member)
    <157>   DW_AT_name        : AFR
    <15b>   DW_AT_decl_file   : 5
    <15c>   DW_AT_decl_line   : 275
    <15e>   DW_AT_decl_column : 17
    <15f>   DW_AT_type        : <0x175>
    <163>   DW_AT_data_member_location: 32
 <2><164>: Abbrev Number: 0
 <1><165>: Abbrev Number: 6 (DW_TAG_array_type)
    <166>   DW_AT_type        : <0xb7>
    <16a>   DW_AT_sibling     : <0x175>
 <2><16e>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <16f>   DW_AT_type        : <0x8c>
    <173>   DW_AT_upper_bound : 1
 <2><174>: Abbrev Number: 0
 <1><175>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <176>   DW_AT_type        : <0x165>
 <1><17a>: Abbrev Number: 11 (DW_TAG_typedef)
    <17b>   DW_AT_name        : (indirect string, offset: 0x6b395): GPIO_TypeDef
    <17f>   DW_AT_decl_file   : 5
    <180>   DW_AT_decl_line   : 276
    <182>   DW_AT_decl_column : 3
    <183>   DW_AT_type        : <0xdc>
 <1><187>: Abbrev Number: 8 (DW_TAG_structure_type)
    <188>   DW_AT_byte_size   : 8
    <189>   DW_AT_decl_file   : 5
    <18a>   DW_AT_decl_line   : 326
    <18c>   DW_AT_decl_column : 9
    <18d>   DW_AT_sibling     : <0x1ad>
 <2><191>: Abbrev Number: 10 (DW_TAG_member)
    <192>   DW_AT_name        : CR
    <195>   DW_AT_decl_file   : 5
    <196>   DW_AT_decl_line   : 328
    <198>   DW_AT_decl_column : 17
    <199>   DW_AT_type        : <0xb7>
    <19d>   DW_AT_data_member_location: 0
 <2><19e>: Abbrev Number: 10 (DW_TAG_member)
    <19f>   DW_AT_name        : CSR
    <1a3>   DW_AT_decl_file   : 5
    <1a4>   DW_AT_decl_line   : 329
    <1a6>   DW_AT_decl_column : 17
    <1a7>   DW_AT_type        : <0xb7>
    <1ab>   DW_AT_data_member_location: 4
 <2><1ac>: Abbrev Number: 0
 <1><1ad>: Abbrev Number: 11 (DW_TAG_typedef)
    <1ae>   DW_AT_name        : (indirect string, offset: 0x77643): PWR_TypeDef
    <1b2>   DW_AT_decl_file   : 5
    <1b3>   DW_AT_decl_line   : 330
    <1b5>   DW_AT_decl_column : 3
    <1b6>   DW_AT_type        : <0x187>
 <1><1ba>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1bb>   DW_AT_byte_size   : 144
    <1bc>   DW_AT_decl_file   : 5
    <1bd>   DW_AT_decl_line   : 336
    <1bf>   DW_AT_decl_column : 9
    <1c0>   DW_AT_sibling     : <0x384>
 <2><1c4>: Abbrev Number: 10 (DW_TAG_member)
    <1c5>   DW_AT_name        : CR
    <1c8>   DW_AT_decl_file   : 5
    <1c9>   DW_AT_decl_line   : 338
    <1cb>   DW_AT_decl_column : 17
    <1cc>   DW_AT_type        : <0xb7>
    <1d0>   DW_AT_data_member_location: 0
 <2><1d1>: Abbrev Number: 9 (DW_TAG_member)
    <1d2>   DW_AT_name        : (indirect string, offset: 0x35363): PLLCFGR
    <1d6>   DW_AT_decl_file   : 5
    <1d7>   DW_AT_decl_line   : 339
    <1d9>   DW_AT_decl_column : 17
    <1da>   DW_AT_type        : <0xb7>
    <1de>   DW_AT_data_member_location: 4
 <2><1df>: Abbrev Number: 9 (DW_TAG_member)
    <1e0>   DW_AT_name        : (indirect string, offset: 0x64fe8): CFGR
    <1e4>   DW_AT_decl_file   : 5
    <1e5>   DW_AT_decl_line   : 340
    <1e7>   DW_AT_decl_column : 17
    <1e8>   DW_AT_type        : <0xb7>
    <1ec>   DW_AT_data_member_location: 8
 <2><1ed>: Abbrev Number: 10 (DW_TAG_member)
    <1ee>   DW_AT_name        : CIR
    <1f2>   DW_AT_decl_file   : 5
    <1f3>   DW_AT_decl_line   : 341
    <1f5>   DW_AT_decl_column : 17
    <1f6>   DW_AT_type        : <0xb7>
    <1fa>   DW_AT_data_member_location: 12
 <2><1fb>: Abbrev Number: 9 (DW_TAG_member)
    <1fc>   DW_AT_name        : (indirect string, offset: 0x5578c): AHB1RSTR
    <200>   DW_AT_decl_file   : 5
    <201>   DW_AT_decl_line   : 342
    <203>   DW_AT_decl_column : 17
    <204>   DW_AT_type        : <0xb7>
    <208>   DW_AT_data_member_location: 16
 <2><209>: Abbrev Number: 9 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x69e72): AHB2RSTR
    <20e>   DW_AT_decl_file   : 5
    <20f>   DW_AT_decl_line   : 343
    <211>   DW_AT_decl_column : 17
    <212>   DW_AT_type        : <0xb7>
    <216>   DW_AT_data_member_location: 20
 <2><217>: Abbrev Number: 9 (DW_TAG_member)
    <218>   DW_AT_name        : (indirect string, offset: 0x7e965): AHB3RSTR
    <21c>   DW_AT_decl_file   : 5
    <21d>   DW_AT_decl_line   : 344
    <21f>   DW_AT_decl_column : 17
    <220>   DW_AT_type        : <0xb7>
    <224>   DW_AT_data_member_location: 24
 <2><225>: Abbrev Number: 9 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0xf867): RESERVED0
    <22a>   DW_AT_decl_file   : 5
    <22b>   DW_AT_decl_line   : 345
    <22d>   DW_AT_decl_column : 17
    <22e>   DW_AT_type        : <0xab>
    <232>   DW_AT_data_member_location: 28
 <2><233>: Abbrev Number: 9 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0x1979e): APB1RSTR
    <238>   DW_AT_decl_file   : 5
    <239>   DW_AT_decl_line   : 346
    <23b>   DW_AT_decl_column : 17
    <23c>   DW_AT_type        : <0xb7>
    <240>   DW_AT_data_member_location: 32
 <2><241>: Abbrev Number: 9 (DW_TAG_member)
    <242>   DW_AT_name        : (indirect string, offset: 0xadd2): APB2RSTR
    <246>   DW_AT_decl_file   : 5
    <247>   DW_AT_decl_line   : 347
    <249>   DW_AT_decl_column : 17
    <24a>   DW_AT_type        : <0xb7>
    <24e>   DW_AT_data_member_location: 36
 <2><24f>: Abbrev Number: 9 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0xf88c): RESERVED1
    <254>   DW_AT_decl_file   : 5
    <255>   DW_AT_decl_line   : 348
    <257>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0xcc>
    <25c>   DW_AT_data_member_location: 40
 <2><25d>: Abbrev Number: 9 (DW_TAG_member)
    <25e>   DW_AT_name        : (indirect string, offset: 0x67dda): AHB1ENR
    <262>   DW_AT_decl_file   : 5
    <263>   DW_AT_decl_line   : 349
    <265>   DW_AT_decl_column : 17
    <266>   DW_AT_type        : <0xb7>
    <26a>   DW_AT_data_member_location: 48
 <2><26b>: Abbrev Number: 9 (DW_TAG_member)
    <26c>   DW_AT_name        : (indirect string, offset: 0x16503): AHB2ENR
    <270>   DW_AT_decl_file   : 5
    <271>   DW_AT_decl_line   : 350
    <273>   DW_AT_decl_column : 17
    <274>   DW_AT_type        : <0xb7>
    <278>   DW_AT_data_member_location: 52
 <2><279>: Abbrev Number: 9 (DW_TAG_member)
    <27a>   DW_AT_name        : (indirect string, offset: 0x14a0): AHB3ENR
    <27e>   DW_AT_decl_file   : 5
    <27f>   DW_AT_decl_line   : 351
    <281>   DW_AT_decl_column : 17
    <282>   DW_AT_type        : <0xb7>
    <286>   DW_AT_data_member_location: 56
 <2><287>: Abbrev Number: 9 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0x51cae): RESERVED2
    <28c>   DW_AT_decl_file   : 5
    <28d>   DW_AT_decl_line   : 352
    <28f>   DW_AT_decl_column : 17
    <290>   DW_AT_type        : <0xab>
    <294>   DW_AT_data_member_location: 60
 <2><295>: Abbrev Number: 9 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0x257ca): APB1ENR
    <29a>   DW_AT_decl_file   : 5
    <29b>   DW_AT_decl_line   : 353
    <29d>   DW_AT_decl_column : 17
    <29e>   DW_AT_type        : <0xb7>
    <2a2>   DW_AT_data_member_location: 64
 <2><2a3>: Abbrev Number: 9 (DW_TAG_member)
    <2a4>   DW_AT_name        : (indirect string, offset: 0x52bdc): APB2ENR
    <2a8>   DW_AT_decl_file   : 5
    <2a9>   DW_AT_decl_line   : 354
    <2ab>   DW_AT_decl_column : 17
    <2ac>   DW_AT_type        : <0xb7>
    <2b0>   DW_AT_data_member_location: 68
 <2><2b1>: Abbrev Number: 9 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x51cb8): RESERVED3
    <2b6>   DW_AT_decl_file   : 5
    <2b7>   DW_AT_decl_line   : 355
    <2b9>   DW_AT_decl_column : 17
    <2ba>   DW_AT_type        : <0xcc>
    <2be>   DW_AT_data_member_location: 72
 <2><2bf>: Abbrev Number: 9 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x25490): AHB1LPENR
    <2c4>   DW_AT_decl_file   : 5
    <2c5>   DW_AT_decl_line   : 356
    <2c7>   DW_AT_decl_column : 17
    <2c8>   DW_AT_type        : <0xb7>
    <2cc>   DW_AT_data_member_location: 80
 <2><2cd>: Abbrev Number: 9 (DW_TAG_member)
    <2ce>   DW_AT_name        : (indirect string, offset: 0x58e05): AHB2LPENR
    <2d2>   DW_AT_decl_file   : 5
    <2d3>   DW_AT_decl_line   : 357
    <2d5>   DW_AT_decl_column : 17
    <2d6>   DW_AT_type        : <0xb7>
    <2da>   DW_AT_data_member_location: 84
 <2><2db>: Abbrev Number: 9 (DW_TAG_member)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x65c90): AHB3LPENR
    <2e0>   DW_AT_decl_file   : 5
    <2e1>   DW_AT_decl_line   : 358
    <2e3>   DW_AT_decl_column : 17
    <2e4>   DW_AT_type        : <0xb7>
    <2e8>   DW_AT_data_member_location: 88
 <2><2e9>: Abbrev Number: 9 (DW_TAG_member)
    <2ea>   DW_AT_name        : (indirect string, offset: 0x51cc2): RESERVED4
    <2ee>   DW_AT_decl_file   : 5
    <2ef>   DW_AT_decl_line   : 359
    <2f1>   DW_AT_decl_column : 17
    <2f2>   DW_AT_type        : <0xab>
    <2f6>   DW_AT_data_member_location: 92
 <2><2f7>: Abbrev Number: 9 (DW_TAG_member)
    <2f8>   DW_AT_name        : (indirect string, offset: 0x67425): APB1LPENR
    <2fc>   DW_AT_decl_file   : 5
    <2fd>   DW_AT_decl_line   : 360
    <2ff>   DW_AT_decl_column : 17
    <300>   DW_AT_type        : <0xb7>
    <304>   DW_AT_data_member_location: 96
 <2><305>: Abbrev Number: 9 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0x7fb1e): APB2LPENR
    <30a>   DW_AT_decl_file   : 5
    <30b>   DW_AT_decl_line   : 361
    <30d>   DW_AT_decl_column : 17
    <30e>   DW_AT_type        : <0xb7>
    <312>   DW_AT_data_member_location: 100
 <2><313>: Abbrev Number: 9 (DW_TAG_member)
    <314>   DW_AT_name        : (indirect string, offset: 0x51ccc): RESERVED5
    <318>   DW_AT_decl_file   : 5
    <319>   DW_AT_decl_line   : 362
    <31b>   DW_AT_decl_column : 17
    <31c>   DW_AT_type        : <0xcc>
    <320>   DW_AT_data_member_location: 104
 <2><321>: Abbrev Number: 9 (DW_TAG_member)
    <322>   DW_AT_name        : (indirect string, offset: 0x816ab): BDCR
    <326>   DW_AT_decl_file   : 5
    <327>   DW_AT_decl_line   : 363
    <329>   DW_AT_decl_column : 17
    <32a>   DW_AT_type        : <0xb7>
    <32e>   DW_AT_data_member_location: 112
 <2><32f>: Abbrev Number: 10 (DW_TAG_member)
    <330>   DW_AT_name        : CSR
    <334>   DW_AT_decl_file   : 5
    <335>   DW_AT_decl_line   : 364
    <337>   DW_AT_decl_column : 17
    <338>   DW_AT_type        : <0xb7>
    <33c>   DW_AT_data_member_location: 116
 <2><33d>: Abbrev Number: 9 (DW_TAG_member)
    <33e>   DW_AT_name        : (indirect string, offset: 0x8fa4): RESERVED6
    <342>   DW_AT_decl_file   : 5
    <343>   DW_AT_decl_line   : 365
    <345>   DW_AT_decl_column : 17
    <346>   DW_AT_type        : <0xcc>
    <34a>   DW_AT_data_member_location: 120
 <2><34b>: Abbrev Number: 9 (DW_TAG_member)
    <34c>   DW_AT_name        : (indirect string, offset: 0x6e48b): SSCGR
    <350>   DW_AT_decl_file   : 5
    <351>   DW_AT_decl_line   : 366
    <353>   DW_AT_decl_column : 17
    <354>   DW_AT_type        : <0xb7>
    <358>   DW_AT_data_member_location: 128
 <2><359>: Abbrev Number: 9 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0xd888): PLLI2SCFGR
    <35e>   DW_AT_decl_file   : 5
    <35f>   DW_AT_decl_line   : 367
    <361>   DW_AT_decl_column : 17
    <362>   DW_AT_type        : <0xb7>
    <366>   DW_AT_data_member_location: 132
 <2><367>: Abbrev Number: 9 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0x51d09): RESERVED7
    <36c>   DW_AT_decl_file   : 5
    <36d>   DW_AT_decl_line   : 368
    <36f>   DW_AT_decl_column : 17
    <370>   DW_AT_type        : <0xbc>
    <374>   DW_AT_data_member_location: 136
 <2><375>: Abbrev Number: 9 (DW_TAG_member)
    <376>   DW_AT_name        : (indirect string, offset: 0x64fe5): DCKCFGR
    <37a>   DW_AT_decl_file   : 5
    <37b>   DW_AT_decl_line   : 369
    <37d>   DW_AT_decl_column : 17
    <37e>   DW_AT_type        : <0xb7>
    <382>   DW_AT_data_member_location: 140
 <2><383>: Abbrev Number: 0
 <1><384>: Abbrev Number: 11 (DW_TAG_typedef)
    <385>   DW_AT_name        : (indirect string, offset: 0x1aa91): RCC_TypeDef
    <389>   DW_AT_decl_file   : 5
    <38a>   DW_AT_decl_line   : 370
    <38c>   DW_AT_decl_column : 3
    <38d>   DW_AT_type        : <0x1ba>
 <1><391>: Abbrev Number: 2 (DW_TAG_base_type)
    <392>   DW_AT_byte_size   : 8
    <393>   DW_AT_encoding    : 4	(float)
    <394>   DW_AT_name        : (indirect string, offset: 0x3ed91): long double
 <1><398>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <399>   DW_AT_encoding    : 7	(unsigned)
    <39a>   DW_AT_byte_size   : 1
    <39b>   DW_AT_type        : <0x3c>
    <39f>   DW_AT_decl_file   : 6
    <3a0>   DW_AT_decl_line   : 39
    <3a1>   DW_AT_decl_column : 1
    <3a2>   DW_AT_sibling     : <0x3bf>
 <2><3a6>: Abbrev Number: 13 (DW_TAG_enumerator)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x575f6): HAL_OK
    <3ab>   DW_AT_const_value : 0
 <2><3ac>: Abbrev Number: 13 (DW_TAG_enumerator)
    <3ad>   DW_AT_name        : (indirect string, offset: 0x45a69): HAL_ERROR
    <3b1>   DW_AT_const_value : 1
 <2><3b2>: Abbrev Number: 13 (DW_TAG_enumerator)
    <3b3>   DW_AT_name        : (indirect string, offset: 0x5693): HAL_BUSY
    <3b7>   DW_AT_const_value : 2
 <2><3b8>: Abbrev Number: 13 (DW_TAG_enumerator)
    <3b9>   DW_AT_name        : (indirect string, offset: 0x449cb): HAL_TIMEOUT
    <3bd>   DW_AT_const_value : 3
 <2><3be>: Abbrev Number: 0
 <1><3bf>: Abbrev Number: 3 (DW_TAG_typedef)
    <3c0>   DW_AT_name        : (indirect string, offset: 0x7a96a): HAL_StatusTypeDef
    <3c4>   DW_AT_decl_file   : 6
    <3c5>   DW_AT_decl_line   : 44
    <3c6>   DW_AT_decl_column : 3
    <3c7>   DW_AT_type        : <0x398>
 <1><3cb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3cc>   DW_AT_byte_size   : 24
    <3cd>   DW_AT_decl_file   : 7
    <3ce>   DW_AT_decl_line   : 45
    <3cf>   DW_AT_decl_column : 9
    <3d0>   DW_AT_sibling     : <0x423>
 <2><3d4>: Abbrev Number: 15 (DW_TAG_member)
    <3d5>   DW_AT_name        : (indirect string, offset: 0x73e66): PLLState
    <3d9>   DW_AT_decl_file   : 7
    <3da>   DW_AT_decl_line   : 47
    <3db>   DW_AT_decl_column : 12
    <3dc>   DW_AT_type        : <0xab>
    <3e0>   DW_AT_data_member_location: 0
 <2><3e1>: Abbrev Number: 15 (DW_TAG_member)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x54cdc): PLLSource
    <3e6>   DW_AT_decl_file   : 7
    <3e7>   DW_AT_decl_line   : 50
    <3e8>   DW_AT_decl_column : 12
    <3e9>   DW_AT_type        : <0xab>
    <3ed>   DW_AT_data_member_location: 4
 <2><3ee>: Abbrev Number: 15 (DW_TAG_member)
    <3ef>   DW_AT_name        : (indirect string, offset: 0x4a4e4): PLLM
    <3f3>   DW_AT_decl_file   : 7
    <3f4>   DW_AT_decl_line   : 53
    <3f5>   DW_AT_decl_column : 12
    <3f6>   DW_AT_type        : <0xab>
    <3fa>   DW_AT_data_member_location: 8
 <2><3fb>: Abbrev Number: 15 (DW_TAG_member)
    <3fc>   DW_AT_name        : (indirect string, offset: 0x69ae2): PLLN
    <400>   DW_AT_decl_file   : 7
    <401>   DW_AT_decl_line   : 56
    <402>   DW_AT_decl_column : 12
    <403>   DW_AT_type        : <0xab>
    <407>   DW_AT_data_member_location: 12
 <2><408>: Abbrev Number: 15 (DW_TAG_member)
    <409>   DW_AT_name        : (indirect string, offset: 0x69b0f): PLLP
    <40d>   DW_AT_decl_file   : 7
    <40e>   DW_AT_decl_line   : 60
    <40f>   DW_AT_decl_column : 12
    <410>   DW_AT_type        : <0xab>
    <414>   DW_AT_data_member_location: 16
 <2><415>: Abbrev Number: 15 (DW_TAG_member)
    <416>   DW_AT_name        : (indirect string, offset: 0x70f22): PLLQ
    <41a>   DW_AT_decl_file   : 7
    <41b>   DW_AT_decl_line   : 63
    <41c>   DW_AT_decl_column : 12
    <41d>   DW_AT_type        : <0xab>
    <421>   DW_AT_data_member_location: 20
 <2><422>: Abbrev Number: 0
 <1><423>: Abbrev Number: 3 (DW_TAG_typedef)
    <424>   DW_AT_name        : (indirect string, offset: 0x5eb62): RCC_PLLInitTypeDef
    <428>   DW_AT_decl_file   : 7
    <429>   DW_AT_decl_line   : 73
    <42a>   DW_AT_decl_column : 2
    <42b>   DW_AT_type        : <0x3cb>
 <1><42f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <430>   DW_AT_byte_size   : 48
    <431>   DW_AT_decl_file   : 8
    <432>   DW_AT_decl_line   : 49
    <433>   DW_AT_decl_column : 9
    <434>   DW_AT_sibling     : <0x494>
 <2><438>: Abbrev Number: 15 (DW_TAG_member)
    <439>   DW_AT_name        : (indirect string, offset: 0x81211): OscillatorType
    <43d>   DW_AT_decl_file   : 8
    <43e>   DW_AT_decl_line   : 51
    <43f>   DW_AT_decl_column : 12
    <440>   DW_AT_type        : <0xab>
    <444>   DW_AT_data_member_location: 0
 <2><445>: Abbrev Number: 15 (DW_TAG_member)
    <446>   DW_AT_name        : (indirect string, offset: 0x270ae): HSEState
    <44a>   DW_AT_decl_file   : 8
    <44b>   DW_AT_decl_line   : 54
    <44c>   DW_AT_decl_column : 12
    <44d>   DW_AT_type        : <0xab>
    <451>   DW_AT_data_member_location: 4
 <2><452>: Abbrev Number: 15 (DW_TAG_member)
    <453>   DW_AT_name        : (indirect string, offset: 0x437e7): LSEState
    <457>   DW_AT_decl_file   : 8
    <458>   DW_AT_decl_line   : 57
    <459>   DW_AT_decl_column : 12
    <45a>   DW_AT_type        : <0xab>
    <45e>   DW_AT_data_member_location: 8
 <2><45f>: Abbrev Number: 15 (DW_TAG_member)
    <460>   DW_AT_name        : (indirect string, offset: 0x6266): HSIState
    <464>   DW_AT_decl_file   : 8
    <465>   DW_AT_decl_line   : 60
    <466>   DW_AT_decl_column : 12
    <467>   DW_AT_type        : <0xab>
    <46b>   DW_AT_data_member_location: 12
 <2><46c>: Abbrev Number: 15 (DW_TAG_member)
    <46d>   DW_AT_name        : (indirect string, offset: 0x3fc85): HSICalibrationValue
    <471>   DW_AT_decl_file   : 8
    <472>   DW_AT_decl_line   : 63
    <473>   DW_AT_decl_column : 12
    <474>   DW_AT_type        : <0xab>
    <478>   DW_AT_data_member_location: 16
 <2><479>: Abbrev Number: 15 (DW_TAG_member)
    <47a>   DW_AT_name        : (indirect string, offset: 0x1bf63): LSIState
    <47e>   DW_AT_decl_file   : 8
    <47f>   DW_AT_decl_line   : 66
    <480>   DW_AT_decl_column : 12
    <481>   DW_AT_type        : <0xab>
    <485>   DW_AT_data_member_location: 20
 <2><486>: Abbrev Number: 16 (DW_TAG_member)
    <487>   DW_AT_name        : PLL
    <48b>   DW_AT_decl_file   : 8
    <48c>   DW_AT_decl_line   : 69
    <48d>   DW_AT_decl_column : 22
    <48e>   DW_AT_type        : <0x423>
    <492>   DW_AT_data_member_location: 24
 <2><493>: Abbrev Number: 0
 <1><494>: Abbrev Number: 3 (DW_TAG_typedef)
    <495>   DW_AT_name        : (indirect string, offset: 0x62aca): RCC_OscInitTypeDef
    <499>   DW_AT_decl_file   : 8
    <49a>   DW_AT_decl_line   : 70
    <49b>   DW_AT_decl_column : 2
    <49c>   DW_AT_type        : <0x42f>
 <1><4a0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <4a1>   DW_AT_byte_size   : 20
    <4a2>   DW_AT_decl_file   : 8
    <4a3>   DW_AT_decl_line   : 75
    <4a4>   DW_AT_decl_column : 9
    <4a5>   DW_AT_sibling     : <0x4eb>
 <2><4a9>: Abbrev Number: 15 (DW_TAG_member)
    <4aa>   DW_AT_name        : (indirect string, offset: 0x17213): ClockType
    <4ae>   DW_AT_decl_file   : 8
    <4af>   DW_AT_decl_line   : 77
    <4b0>   DW_AT_decl_column : 12
    <4b1>   DW_AT_type        : <0xab>
    <4b5>   DW_AT_data_member_location: 0
 <2><4b6>: Abbrev Number: 15 (DW_TAG_member)
    <4b7>   DW_AT_name        : (indirect string, offset: 0x37b7e): SYSCLKSource
    <4bb>   DW_AT_decl_file   : 8
    <4bc>   DW_AT_decl_line   : 80
    <4bd>   DW_AT_decl_column : 12
    <4be>   DW_AT_type        : <0xab>
    <4c2>   DW_AT_data_member_location: 4
 <2><4c3>: Abbrev Number: 15 (DW_TAG_member)
    <4c4>   DW_AT_name        : (indirect string, offset: 0x5e82): AHBCLKDivider
    <4c8>   DW_AT_decl_file   : 8
    <4c9>   DW_AT_decl_line   : 83
    <4ca>   DW_AT_decl_column : 12
    <4cb>   DW_AT_type        : <0xab>
    <4cf>   DW_AT_data_member_location: 8
 <2><4d0>: Abbrev Number: 15 (DW_TAG_member)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x41713): APB1CLKDivider
    <4d5>   DW_AT_decl_file   : 8
    <4d6>   DW_AT_decl_line   : 86
    <4d7>   DW_AT_decl_column : 12
    <4d8>   DW_AT_type        : <0xab>
    <4dc>   DW_AT_data_member_location: 12
 <2><4dd>: Abbrev Number: 15 (DW_TAG_member)
    <4de>   DW_AT_name        : (indirect string, offset: 0x107f9): APB2CLKDivider
    <4e2>   DW_AT_decl_file   : 8
    <4e3>   DW_AT_decl_line   : 89
    <4e4>   DW_AT_decl_column : 12
    <4e5>   DW_AT_type        : <0xab>
    <4e9>   DW_AT_data_member_location: 16
 <2><4ea>: Abbrev Number: 0
 <1><4eb>: Abbrev Number: 3 (DW_TAG_typedef)
    <4ec>   DW_AT_name        : (indirect string, offset: 0x7a833): RCC_ClkInitTypeDef
    <4f0>   DW_AT_decl_file   : 8
    <4f1>   DW_AT_decl_line   : 92
    <4f2>   DW_AT_decl_column : 2
    <4f3>   DW_AT_type        : <0x4a0>
 <1><4f7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <4f8>   DW_AT_byte_size   : 20
    <4f9>   DW_AT_decl_file   : 9
    <4fa>   DW_AT_decl_line   : 46
    <4fb>   DW_AT_decl_column : 9
    <4fc>   DW_AT_sibling     : <0x542>
 <2><500>: Abbrev Number: 16 (DW_TAG_member)
    <501>   DW_AT_name        : Pin
    <505>   DW_AT_decl_file   : 9
    <506>   DW_AT_decl_line   : 48
    <507>   DW_AT_decl_column : 12
    <508>   DW_AT_type        : <0xab>
    <50c>   DW_AT_data_member_location: 0
 <2><50d>: Abbrev Number: 15 (DW_TAG_member)
    <50e>   DW_AT_name        : (indirect string, offset: 0x176ec): Mode
    <512>   DW_AT_decl_file   : 9
    <513>   DW_AT_decl_line   : 51
    <514>   DW_AT_decl_column : 12
    <515>   DW_AT_type        : <0xab>
    <519>   DW_AT_data_member_location: 4
 <2><51a>: Abbrev Number: 15 (DW_TAG_member)
    <51b>   DW_AT_name        : (indirect string, offset: 0x29662): Pull
    <51f>   DW_AT_decl_file   : 9
    <520>   DW_AT_decl_line   : 54
    <521>   DW_AT_decl_column : 12
    <522>   DW_AT_type        : <0xab>
    <526>   DW_AT_data_member_location: 8
 <2><527>: Abbrev Number: 15 (DW_TAG_member)
    <528>   DW_AT_name        : (indirect string, offset: 0x5fbff): Speed
    <52c>   DW_AT_decl_file   : 9
    <52d>   DW_AT_decl_line   : 57
    <52e>   DW_AT_decl_column : 12
    <52f>   DW_AT_type        : <0xab>
    <533>   DW_AT_data_member_location: 12
 <2><534>: Abbrev Number: 15 (DW_TAG_member)
    <535>   DW_AT_name        : (indirect string, offset: 0x22148): Alternate
    <539>   DW_AT_decl_file   : 9
    <53a>   DW_AT_decl_line   : 60
    <53b>   DW_AT_decl_column : 12
    <53c>   DW_AT_type        : <0xab>
    <540>   DW_AT_data_member_location: 16
 <2><541>: Abbrev Number: 0
 <1><542>: Abbrev Number: 3 (DW_TAG_typedef)
    <543>   DW_AT_name        : (indirect string, offset: 0x7bb06): GPIO_InitTypeDef
    <547>   DW_AT_decl_file   : 9
    <548>   DW_AT_decl_line   : 62
    <549>   DW_AT_decl_column : 2
    <54a>   DW_AT_type        : <0x4f7>
 <1><54e>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <54f>   DW_AT_encoding    : 7	(unsigned)
    <550>   DW_AT_byte_size   : 1
    <551>   DW_AT_type        : <0x3c>
    <555>   DW_AT_decl_file   : 9
    <556>   DW_AT_decl_line   : 68
    <557>   DW_AT_decl_column : 1
    <558>   DW_AT_sibling     : <0x569>
 <2><55c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <55d>   DW_AT_name        : (indirect string, offset: 0x6149a): GPIO_PIN_RESET
    <561>   DW_AT_const_value : 0
 <2><562>: Abbrev Number: 13 (DW_TAG_enumerator)
    <563>   DW_AT_name        : (indirect string, offset: 0x24cb0): GPIO_PIN_SET
    <567>   DW_AT_const_value : 1
 <2><568>: Abbrev Number: 0
 <1><569>: Abbrev Number: 3 (DW_TAG_typedef)
    <56a>   DW_AT_name        : (indirect string, offset: 0x46e23): GPIO_PinState
    <56e>   DW_AT_decl_file   : 9
    <56f>   DW_AT_decl_line   : 71
    <570>   DW_AT_decl_column : 2
    <571>   DW_AT_type        : <0x54e>
 <1><575>: Abbrev Number: 2 (DW_TAG_base_type)
    <576>   DW_AT_byte_size   : 1
    <577>   DW_AT_encoding    : 8	(unsigned char)
    <578>   DW_AT_name        : (indirect string, offset: 0x60f98): char
 <1><57c>: Abbrev Number: 17 (DW_TAG_const_type)
    <57d>   DW_AT_type        : <0x575>
 <1><581>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <582>   DW_AT_byte_size   : 4
    <583>   DW_AT_type        : <0x57c>
 <1><587>: Abbrev Number: 19 (DW_TAG_subprogram)
    <588>   DW_AT_external    : 1
    <588>   DW_AT_name        : (indirect string, offset: 0x8ea3): HAL_GPIO_Init
    <58c>   DW_AT_decl_file   : 9
    <58d>   DW_AT_decl_line   : 224
    <58e>   DW_AT_decl_column : 7
    <58f>   DW_AT_prototyped  : 1
    <58f>   DW_AT_declaration : 1
    <58f>   DW_AT_sibling     : <0x59e>
 <2><593>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <594>   DW_AT_type        : <0x59e>
 <2><598>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <599>   DW_AT_type        : <0x5a4>
 <2><59d>: Abbrev Number: 0
 <1><59e>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <59f>   DW_AT_byte_size   : 4
    <5a0>   DW_AT_type        : <0x17a>
 <1><5a4>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <5a5>   DW_AT_byte_size   : 4
    <5a6>   DW_AT_type        : <0x542>
 <1><5aa>: Abbrev Number: 21 (DW_TAG_subprogram)
    <5ab>   DW_AT_external    : 1
    <5ab>   DW_AT_name        : (indirect string, offset: 0x3445e): HAL_RCC_ClockConfig
    <5af>   DW_AT_decl_file   : 8
    <5b0>   DW_AT_decl_line   : 1247
    <5b2>   DW_AT_decl_column : 19
    <5b3>   DW_AT_prototyped  : 1
    <5b3>   DW_AT_type        : <0x3bf>
    <5b7>   DW_AT_declaration : 1
    <5b7>   DW_AT_sibling     : <0x5c6>
 <2><5bb>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5bc>   DW_AT_type        : <0x5c6>
 <2><5c0>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5c1>   DW_AT_type        : <0xab>
 <2><5c5>: Abbrev Number: 0
 <1><5c6>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <5c7>   DW_AT_byte_size   : 4
    <5c8>   DW_AT_type        : <0x4eb>
 <1><5cc>: Abbrev Number: 21 (DW_TAG_subprogram)
    <5cd>   DW_AT_external    : 1
    <5cd>   DW_AT_name        : (indirect string, offset: 0x22b1e): HAL_RCC_OscConfig
    <5d1>   DW_AT_decl_file   : 8
    <5d2>   DW_AT_decl_line   : 1246
    <5d4>   DW_AT_decl_column : 19
    <5d5>   DW_AT_prototyped  : 1
    <5d5>   DW_AT_type        : <0x3bf>
    <5d9>   DW_AT_declaration : 1
    <5d9>   DW_AT_sibling     : <0x5e3>
 <2><5dd>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5de>   DW_AT_type        : <0x5e3>
 <2><5e2>: Abbrev Number: 0
 <1><5e3>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <5e4>   DW_AT_byte_size   : 4
    <5e5>   DW_AT_type        : <0x494>
 <1><5e9>: Abbrev Number: 22 (DW_TAG_subprogram)
    <5ea>   DW_AT_external    : 1
    <5ea>   DW_AT_name        : (indirect string, offset: 0x2433a): printf
    <5ee>   DW_AT_decl_file   : 10
    <5ef>   DW_AT_decl_line   : 200
    <5f0>   DW_AT_decl_column : 5
    <5f1>   DW_AT_prototyped  : 1
    <5f1>   DW_AT_type        : <0x85>
    <5f5>   DW_AT_declaration : 1
    <5f5>   DW_AT_sibling     : <0x600>
 <2><5f9>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5fa>   DW_AT_type        : <0x581>
 <2><5fe>: Abbrev Number: 23 (DW_TAG_unspecified_parameters)
 <2><5ff>: Abbrev Number: 0
 <1><600>: Abbrev Number: 22 (DW_TAG_subprogram)
    <601>   DW_AT_external    : 1
    <601>   DW_AT_name        : (indirect string, offset: 0x65c8): HAL_GPIO_ReadPin
    <605>   DW_AT_decl_file   : 9
    <606>   DW_AT_decl_line   : 234
    <607>   DW_AT_decl_column : 15
    <608>   DW_AT_prototyped  : 1
    <608>   DW_AT_type        : <0x569>
    <60c>   DW_AT_declaration : 1
    <60c>   DW_AT_sibling     : <0x61b>
 <2><610>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <611>   DW_AT_type        : <0x59e>
 <2><615>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <616>   DW_AT_type        : <0x9f>
 <2><61a>: Abbrev Number: 0
 <1><61b>: Abbrev Number: 19 (DW_TAG_subprogram)
    <61c>   DW_AT_external    : 1
    <61c>   DW_AT_name        : (indirect string, offset: 0x38e94): HAL_Delay
    <620>   DW_AT_decl_file   : 11
    <621>   DW_AT_decl_line   : 233
    <622>   DW_AT_decl_column : 6
    <623>   DW_AT_prototyped  : 1
    <623>   DW_AT_declaration : 1
    <623>   DW_AT_sibling     : <0x62d>
 <2><627>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <628>   DW_AT_type        : <0xab>
 <2><62c>: Abbrev Number: 0
 <1><62d>: Abbrev Number: 19 (DW_TAG_subprogram)
    <62e>   DW_AT_external    : 1
    <62e>   DW_AT_name        : (indirect string, offset: 0x705c): HAL_GPIO_WritePin
    <632>   DW_AT_decl_file   : 9
    <633>   DW_AT_decl_line   : 235
    <634>   DW_AT_decl_column : 6
    <635>   DW_AT_prototyped  : 1
    <635>   DW_AT_declaration : 1
    <635>   DW_AT_sibling     : <0x649>
 <2><639>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <63a>   DW_AT_type        : <0x59e>
 <2><63e>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <63f>   DW_AT_type        : <0x9f>
 <2><643>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <644>   DW_AT_type        : <0x569>
 <2><648>: Abbrev Number: 0
 <1><649>: Abbrev Number: 24 (DW_TAG_subprogram)
    <64a>   DW_AT_external    : 1
    <64a>   DW_AT_name        : (indirect string, offset: 0x4106f): HAL_Init
    <64e>   DW_AT_decl_file   : 11
    <64f>   DW_AT_decl_line   : 219
    <650>   DW_AT_decl_column : 19
    <651>   DW_AT_prototyped  : 1
    <651>   DW_AT_type        : <0x3bf>
    <655>   DW_AT_declaration : 1
 <1><655>: Abbrev Number: 25 (DW_TAG_subprogram)
    <656>   DW_AT_external    : 1
    <656>   DW_AT_name        : (indirect string, offset: 0x667d5): initialise_monitor_handles
    <65a>   DW_AT_decl_file   : 1
    <65b>   DW_AT_decl_line   : 65
    <65c>   DW_AT_decl_column : 13
    <65d>   DW_AT_prototyped  : 1
    <65d>   DW_AT_declaration : 1
 <1><65d>: Abbrev Number: 26 (DW_TAG_subprogram)
    <65e>   DW_AT_external    : 1
    <65e>   DW_AT_name        : (indirect string, offset: 0x64452): Error_Handler
    <662>   DW_AT_decl_file   : 1
    <663>   DW_AT_decl_line   : 207
    <664>   DW_AT_decl_column : 6
    <665>   DW_AT_prototyped  : 1
    <665>   DW_AT_low_pc      : 0x80007ac
    <669>   DW_AT_high_pc     : 0xa
    <66d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <66f>   DW_AT_GNU_all_call_sites: 1
    <66f>   DW_AT_sibling     : <0x684>
 <2><673>: Abbrev Number: 27 (DW_TAG_inlined_subroutine)
    <674>   DW_AT_abstract_origin: <0x7ba>
    <678>   DW_AT_low_pc      : 0x80007b0
    <67c>   DW_AT_high_pc     : 0x4
    <680>   DW_AT_call_file   : 1
    <681>   DW_AT_call_line   : 211
    <682>   DW_AT_call_column : 3
 <2><683>: Abbrev Number: 0
 <1><684>: Abbrev Number: 28 (DW_TAG_subprogram)
    <685>   DW_AT_name        : (indirect string, offset: 0x738ed): MX_GPIO_Init
    <689>   DW_AT_decl_file   : 1
    <68a>   DW_AT_decl_line   : 178
    <68b>   DW_AT_decl_column : 13
    <68c>   DW_AT_prototyped  : 1
    <68c>   DW_AT_low_pc      : 0x8000708
    <690>   DW_AT_high_pc     : 0xa4
    <694>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <696>   DW_AT_GNU_all_tail_call_sites: 1
    <696>   DW_AT_sibling     : <0x6fd>
 <2><69a>: Abbrev Number: 29 (DW_TAG_variable)
    <69b>   DW_AT_name        : (indirect string, offset: 0x260ce): GPIO_InitStruct
    <69f>   DW_AT_decl_file   : 1
    <6a0>   DW_AT_decl_line   : 180
    <6a1>   DW_AT_decl_column : 20
    <6a2>   DW_AT_type        : <0x542>
    <6a6>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><6a9>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <6aa>   DW_AT_low_pc      : 0x800071e
    <6ae>   DW_AT_high_pc     : 0x1c
    <6b2>   DW_AT_sibling     : <0x6c6>
 <3><6b6>: Abbrev Number: 29 (DW_TAG_variable)
    <6b7>   DW_AT_name        : (indirect string, offset: 0x69c5c): tmpreg
    <6bb>   DW_AT_decl_file   : 1
    <6bc>   DW_AT_decl_line   : 183
    <6bd>   DW_AT_decl_column : 3
    <6be>   DW_AT_type        : <0xb7>
    <6c2>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><6c5>: Abbrev Number: 0
 <2><6c6>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <6c7>   DW_AT_low_pc      : 0x800073a
    <6cb>   DW_AT_high_pc     : 0x1c
    <6cf>   DW_AT_sibling     : <0x6e3>
 <3><6d3>: Abbrev Number: 29 (DW_TAG_variable)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x69c5c): tmpreg
    <6d8>   DW_AT_decl_file   : 1
    <6d9>   DW_AT_decl_line   : 184
    <6da>   DW_AT_decl_column : 3
    <6db>   DW_AT_type        : <0xb7>
    <6df>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><6e2>: Abbrev Number: 0
 <2><6e3>: Abbrev Number: 31 (DW_TAG_lexical_block)
    <6e4>   DW_AT_low_pc      : 0x8000756
    <6e8>   DW_AT_high_pc     : 0x1c
 <3><6ec>: Abbrev Number: 29 (DW_TAG_variable)
    <6ed>   DW_AT_name        : (indirect string, offset: 0x69c5c): tmpreg
    <6f1>   DW_AT_decl_file   : 1
    <6f2>   DW_AT_decl_line   : 185
    <6f3>   DW_AT_decl_column : 3
    <6f4>   DW_AT_type        : <0xb7>
    <6f8>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><6fb>: Abbrev Number: 0
 <2><6fc>: Abbrev Number: 0
 <1><6fd>: Abbrev Number: 32 (DW_TAG_subprogram)
    <6fe>   DW_AT_external    : 1
    <6fe>   DW_AT_name        : (indirect string, offset: 0x77cac): SystemClock_Config
    <702>   DW_AT_decl_file   : 1
    <703>   DW_AT_decl_line   : 131
    <704>   DW_AT_decl_column : 6
    <705>   DW_AT_prototyped  : 1
    <705>   DW_AT_low_pc      : 0x8000638
    <709>   DW_AT_high_pc     : 0xd0
    <70d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <70f>   DW_AT_GNU_all_tail_call_sites: 1
    <70f>   DW_AT_sibling     : <0x76b>
 <2><713>: Abbrev Number: 29 (DW_TAG_variable)
    <714>   DW_AT_name        : (indirect string, offset: 0x3d84e): RCC_OscInitStruct
    <718>   DW_AT_decl_file   : 1
    <719>   DW_AT_decl_line   : 133
    <71a>   DW_AT_decl_column : 22
    <71b>   DW_AT_type        : <0x494>
    <71f>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><722>: Abbrev Number: 29 (DW_TAG_variable)
    <723>   DW_AT_name        : (indirect string, offset: 0x4ac79): RCC_ClkInitStruct
    <727>   DW_AT_decl_file   : 1
    <728>   DW_AT_decl_line   : 134
    <729>   DW_AT_decl_column : 22
    <72a>   DW_AT_type        : <0x4eb>
    <72e>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><732>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <733>   DW_AT_low_pc      : 0x800065c
    <737>   DW_AT_high_pc     : 0x1c
    <73b>   DW_AT_sibling     : <0x750>
 <3><73f>: Abbrev Number: 29 (DW_TAG_variable)
    <740>   DW_AT_name        : (indirect string, offset: 0x69c5c): tmpreg
    <744>   DW_AT_decl_file   : 1
    <745>   DW_AT_decl_line   : 138
    <746>   DW_AT_decl_column : 3
    <747>   DW_AT_type        : <0xb7>
    <74b>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><74f>: Abbrev Number: 0
 <2><750>: Abbrev Number: 31 (DW_TAG_lexical_block)
    <751>   DW_AT_low_pc      : 0x8000678
    <755>   DW_AT_high_pc     : 0x1c
 <3><759>: Abbrev Number: 29 (DW_TAG_variable)
    <75a>   DW_AT_name        : (indirect string, offset: 0x69c5c): tmpreg
    <75e>   DW_AT_decl_file   : 1
    <75f>   DW_AT_decl_line   : 139
    <760>   DW_AT_decl_column : 3
    <761>   DW_AT_type        : <0xb7>
    <765>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><769>: Abbrev Number: 0
 <2><76a>: Abbrev Number: 0
 <1><76b>: Abbrev Number: 33 (DW_TAG_subprogram)
    <76c>   DW_AT_external    : 1
    <76c>   DW_AT_name        : (indirect string, offset: 0x13e1e): main
    <770>   DW_AT_decl_file   : 1
    <771>   DW_AT_decl_line   : 72
    <772>   DW_AT_decl_column : 5
    <773>   DW_AT_prototyped  : 1
    <773>   DW_AT_type        : <0x85>
    <777>   DW_AT_low_pc      : 0x8000594
    <77b>   DW_AT_high_pc     : 0xa4
    <77f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <781>   DW_AT_GNU_all_tail_call_sites: 1
    <781>   DW_AT_sibling     : <0x7ba>
 <2><785>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <786>   DW_AT_low_pc      : 0x80005aa
    <78a>   DW_AT_high_pc     : 0x36
    <78e>   DW_AT_sibling     : <0x7a0>
 <3><792>: Abbrev Number: 34 (DW_TAG_variable)
    <793>   DW_AT_name        : i
    <795>   DW_AT_decl_file   : 1
    <796>   DW_AT_decl_line   : 98
    <797>   DW_AT_decl_column : 12
    <798>   DW_AT_type        : <0x85>
    <79c>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><79f>: Abbrev Number: 0
 <2><7a0>: Abbrev Number: 31 (DW_TAG_lexical_block)
    <7a1>   DW_AT_low_pc      : 0x8000604
    <7a5>   DW_AT_high_pc     : 0x24
 <3><7a9>: Abbrev Number: 29 (DW_TAG_variable)
    <7aa>   DW_AT_name        : (indirect string, offset: 0x82eb5): status
    <7ae>   DW_AT_decl_file   : 1
    <7af>   DW_AT_decl_line   : 116
    <7b0>   DW_AT_decl_column : 11
    <7b1>   DW_AT_type        : <0x93>
    <7b5>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <3><7b8>: Abbrev Number: 0
 <2><7b9>: Abbrev Number: 0
 <1><7ba>: Abbrev Number: 35 (DW_TAG_subprogram)
    <7bb>   DW_AT_name        : (indirect string, offset: 0x6afde): __disable_irq
    <7bf>   DW_AT_decl_file   : 2
    <7c0>   DW_AT_decl_line   : 140
    <7c1>   DW_AT_decl_column : 27
    <7c2>   DW_AT_prototyped  : 1
    <7c2>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><7c3>: Abbrev Number: 0
  Compilation Unit @ offset 0x7c4:
   Length:        0x2d0 (32-bit)
   Version:       4
   Abbrev Offset: 0x231
   Pointer Size:  4
 <0><7cf>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <7d0>   DW_AT_producer    : (indirect string, offset: 0x4c9bf): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <7d4>   DW_AT_language    : 12	(ANSI C99)
    <7d5>   DW_AT_name        : (indirect string, offset: 0x81a16): ../Core/Src/stm32f4xx_hal_msp.c
    <7d9>   DW_AT_comp_dir    : (indirect string, offset: 0xca7): E:/Projects/Software/STM32/Lecture1/STM32_GPIO/Debug
    <7dd>   DW_AT_ranges      : 0x28
    <7e1>   DW_AT_low_pc      : 0x0
    <7e5>   DW_AT_stmt_list   : 0x93b
    <7e9>   DW_AT_GNU_macros  : 0x142b8
 <1><7ed>: Abbrev Number: 2 (DW_TAG_base_type)
    <7ee>   DW_AT_byte_size   : 1
    <7ef>   DW_AT_encoding    : 6	(signed char)
    <7f0>   DW_AT_name        : (indirect string, offset: 0x60f91): signed char
 <1><7f4>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f5>   DW_AT_byte_size   : 1
    <7f6>   DW_AT_encoding    : 8	(unsigned char)
    <7f7>   DW_AT_name        : (indirect string, offset: 0x5cfa3): unsigned char
 <1><7fb>: Abbrev Number: 2 (DW_TAG_base_type)
    <7fc>   DW_AT_byte_size   : 2
    <7fd>   DW_AT_encoding    : 5	(signed)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x5123): short int
 <1><802>: Abbrev Number: 2 (DW_TAG_base_type)
    <803>   DW_AT_byte_size   : 2
    <804>   DW_AT_encoding    : 7	(unsigned)
    <805>   DW_AT_name        : (indirect string, offset: 0x41202): short unsigned int
 <1><809>: Abbrev Number: 2 (DW_TAG_base_type)
    <80a>   DW_AT_byte_size   : 4
    <80b>   DW_AT_encoding    : 5	(signed)
    <80c>   DW_AT_name        : (indirect string, offset: 0x1a077): long int
 <1><810>: Abbrev Number: 3 (DW_TAG_typedef)
    <811>   DW_AT_name        : (indirect string, offset: 0x38f02): __uint32_t
    <815>   DW_AT_decl_file   : 2
    <816>   DW_AT_decl_line   : 79
    <817>   DW_AT_decl_column : 25
    <818>   DW_AT_type        : <0x81c>
 <1><81c>: Abbrev Number: 2 (DW_TAG_base_type)
    <81d>   DW_AT_byte_size   : 4
    <81e>   DW_AT_encoding    : 7	(unsigned)
    <81f>   DW_AT_name        : (indirect string, offset: 0x4c75d): long unsigned int
 <1><823>: Abbrev Number: 2 (DW_TAG_base_type)
    <824>   DW_AT_byte_size   : 8
    <825>   DW_AT_encoding    : 5	(signed)
    <826>   DW_AT_name        : (indirect string, offset: 0x338b6): long long int
 <1><82a>: Abbrev Number: 2 (DW_TAG_base_type)
    <82b>   DW_AT_byte_size   : 8
    <82c>   DW_AT_encoding    : 7	(unsigned)
    <82d>   DW_AT_name        : (indirect string, offset: 0x2c0fa): long long unsigned int
 <1><831>: Abbrev Number: 4 (DW_TAG_base_type)
    <832>   DW_AT_byte_size   : 4
    <833>   DW_AT_encoding    : 5	(signed)
    <834>   DW_AT_name        : int
 <1><838>: Abbrev Number: 2 (DW_TAG_base_type)
    <839>   DW_AT_byte_size   : 4
    <83a>   DW_AT_encoding    : 7	(unsigned)
    <83b>   DW_AT_name        : (indirect string, offset: 0x462ef): unsigned int
 <1><83f>: Abbrev Number: 3 (DW_TAG_typedef)
    <840>   DW_AT_name        : (indirect string, offset: 0x38f04): uint32_t
    <844>   DW_AT_decl_file   : 3
    <845>   DW_AT_decl_line   : 48
    <846>   DW_AT_decl_column : 20
    <847>   DW_AT_type        : <0x810>
 <1><84b>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <84c>   DW_AT_type        : <0x83f>
 <1><850>: Abbrev Number: 6 (DW_TAG_array_type)
    <851>   DW_AT_type        : <0x83f>
    <855>   DW_AT_sibling     : <0x860>
 <2><859>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <85a>   DW_AT_type        : <0x838>
    <85e>   DW_AT_upper_bound : 0
 <2><85f>: Abbrev Number: 0
 <1><860>: Abbrev Number: 6 (DW_TAG_array_type)
    <861>   DW_AT_type        : <0x83f>
    <865>   DW_AT_sibling     : <0x870>
 <2><869>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <86a>   DW_AT_type        : <0x838>
    <86e>   DW_AT_upper_bound : 1
 <2><86f>: Abbrev Number: 0
 <1><870>: Abbrev Number: 8 (DW_TAG_structure_type)
    <871>   DW_AT_byte_size   : 144
    <872>   DW_AT_decl_file   : 4
    <873>   DW_AT_decl_line   : 336
    <875>   DW_AT_decl_column : 9
    <876>   DW_AT_sibling     : <0xa3a>
 <2><87a>: Abbrev Number: 9 (DW_TAG_member)
    <87b>   DW_AT_name        : CR
    <87e>   DW_AT_decl_file   : 4
    <87f>   DW_AT_decl_line   : 338
    <881>   DW_AT_decl_column : 17
    <882>   DW_AT_type        : <0x84b>
    <886>   DW_AT_data_member_location: 0
 <2><887>: Abbrev Number: 10 (DW_TAG_member)
    <888>   DW_AT_name        : (indirect string, offset: 0x35363): PLLCFGR
    <88c>   DW_AT_decl_file   : 4
    <88d>   DW_AT_decl_line   : 339
    <88f>   DW_AT_decl_column : 17
    <890>   DW_AT_type        : <0x84b>
    <894>   DW_AT_data_member_location: 4
 <2><895>: Abbrev Number: 10 (DW_TAG_member)
    <896>   DW_AT_name        : (indirect string, offset: 0x64fe8): CFGR
    <89a>   DW_AT_decl_file   : 4
    <89b>   DW_AT_decl_line   : 340
    <89d>   DW_AT_decl_column : 17
    <89e>   DW_AT_type        : <0x84b>
    <8a2>   DW_AT_data_member_location: 8
 <2><8a3>: Abbrev Number: 9 (DW_TAG_member)
    <8a4>   DW_AT_name        : CIR
    <8a8>   DW_AT_decl_file   : 4
    <8a9>   DW_AT_decl_line   : 341
    <8ab>   DW_AT_decl_column : 17
    <8ac>   DW_AT_type        : <0x84b>
    <8b0>   DW_AT_data_member_location: 12
 <2><8b1>: Abbrev Number: 10 (DW_TAG_member)
    <8b2>   DW_AT_name        : (indirect string, offset: 0x5578c): AHB1RSTR
    <8b6>   DW_AT_decl_file   : 4
    <8b7>   DW_AT_decl_line   : 342
    <8b9>   DW_AT_decl_column : 17
    <8ba>   DW_AT_type        : <0x84b>
    <8be>   DW_AT_data_member_location: 16
 <2><8bf>: Abbrev Number: 10 (DW_TAG_member)
    <8c0>   DW_AT_name        : (indirect string, offset: 0x69e72): AHB2RSTR
    <8c4>   DW_AT_decl_file   : 4
    <8c5>   DW_AT_decl_line   : 343
    <8c7>   DW_AT_decl_column : 17
    <8c8>   DW_AT_type        : <0x84b>
    <8cc>   DW_AT_data_member_location: 20
 <2><8cd>: Abbrev Number: 10 (DW_TAG_member)
    <8ce>   DW_AT_name        : (indirect string, offset: 0x7e965): AHB3RSTR
    <8d2>   DW_AT_decl_file   : 4
    <8d3>   DW_AT_decl_line   : 344
    <8d5>   DW_AT_decl_column : 17
    <8d6>   DW_AT_type        : <0x84b>
    <8da>   DW_AT_data_member_location: 24
 <2><8db>: Abbrev Number: 10 (DW_TAG_member)
    <8dc>   DW_AT_name        : (indirect string, offset: 0xf867): RESERVED0
    <8e0>   DW_AT_decl_file   : 4
    <8e1>   DW_AT_decl_line   : 345
    <8e3>   DW_AT_decl_column : 17
    <8e4>   DW_AT_type        : <0x83f>
    <8e8>   DW_AT_data_member_location: 28
 <2><8e9>: Abbrev Number: 10 (DW_TAG_member)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x1979e): APB1RSTR
    <8ee>   DW_AT_decl_file   : 4
    <8ef>   DW_AT_decl_line   : 346
    <8f1>   DW_AT_decl_column : 17
    <8f2>   DW_AT_type        : <0x84b>
    <8f6>   DW_AT_data_member_location: 32
 <2><8f7>: Abbrev Number: 10 (DW_TAG_member)
    <8f8>   DW_AT_name        : (indirect string, offset: 0xadd2): APB2RSTR
    <8fc>   DW_AT_decl_file   : 4
    <8fd>   DW_AT_decl_line   : 347
    <8ff>   DW_AT_decl_column : 17
    <900>   DW_AT_type        : <0x84b>
    <904>   DW_AT_data_member_location: 36
 <2><905>: Abbrev Number: 10 (DW_TAG_member)
    <906>   DW_AT_name        : (indirect string, offset: 0xf88c): RESERVED1
    <90a>   DW_AT_decl_file   : 4
    <90b>   DW_AT_decl_line   : 348
    <90d>   DW_AT_decl_column : 17
    <90e>   DW_AT_type        : <0x860>
    <912>   DW_AT_data_member_location: 40
 <2><913>: Abbrev Number: 10 (DW_TAG_member)
    <914>   DW_AT_name        : (indirect string, offset: 0x67dda): AHB1ENR
    <918>   DW_AT_decl_file   : 4
    <919>   DW_AT_decl_line   : 349
    <91b>   DW_AT_decl_column : 17
    <91c>   DW_AT_type        : <0x84b>
    <920>   DW_AT_data_member_location: 48
 <2><921>: Abbrev Number: 10 (DW_TAG_member)
    <922>   DW_AT_name        : (indirect string, offset: 0x16503): AHB2ENR
    <926>   DW_AT_decl_file   : 4
    <927>   DW_AT_decl_line   : 350
    <929>   DW_AT_decl_column : 17
    <92a>   DW_AT_type        : <0x84b>
    <92e>   DW_AT_data_member_location: 52
 <2><92f>: Abbrev Number: 10 (DW_TAG_member)
    <930>   DW_AT_name        : (indirect string, offset: 0x14a0): AHB3ENR
    <934>   DW_AT_decl_file   : 4
    <935>   DW_AT_decl_line   : 351
    <937>   DW_AT_decl_column : 17
    <938>   DW_AT_type        : <0x84b>
    <93c>   DW_AT_data_member_location: 56
 <2><93d>: Abbrev Number: 10 (DW_TAG_member)
    <93e>   DW_AT_name        : (indirect string, offset: 0x51cae): RESERVED2
    <942>   DW_AT_decl_file   : 4
    <943>   DW_AT_decl_line   : 352
    <945>   DW_AT_decl_column : 17
    <946>   DW_AT_type        : <0x83f>
    <94a>   DW_AT_data_member_location: 60
 <2><94b>: Abbrev Number: 10 (DW_TAG_member)
    <94c>   DW_AT_name        : (indirect string, offset: 0x257ca): APB1ENR
    <950>   DW_AT_decl_file   : 4
    <951>   DW_AT_decl_line   : 353
    <953>   DW_AT_decl_column : 17
    <954>   DW_AT_type        : <0x84b>
    <958>   DW_AT_data_member_location: 64
 <2><959>: Abbrev Number: 10 (DW_TAG_member)
    <95a>   DW_AT_name        : (indirect string, offset: 0x52bdc): APB2ENR
    <95e>   DW_AT_decl_file   : 4
    <95f>   DW_AT_decl_line   : 354
    <961>   DW_AT_decl_column : 17
    <962>   DW_AT_type        : <0x84b>
    <966>   DW_AT_data_member_location: 68
 <2><967>: Abbrev Number: 10 (DW_TAG_member)
    <968>   DW_AT_name        : (indirect string, offset: 0x51cb8): RESERVED3
    <96c>   DW_AT_decl_file   : 4
    <96d>   DW_AT_decl_line   : 355
    <96f>   DW_AT_decl_column : 17
    <970>   DW_AT_type        : <0x860>
    <974>   DW_AT_data_member_location: 72
 <2><975>: Abbrev Number: 10 (DW_TAG_member)
    <976>   DW_AT_name        : (indirect string, offset: 0x25490): AHB1LPENR
    <97a>   DW_AT_decl_file   : 4
    <97b>   DW_AT_decl_line   : 356
    <97d>   DW_AT_decl_column : 17
    <97e>   DW_AT_type        : <0x84b>
    <982>   DW_AT_data_member_location: 80
 <2><983>: Abbrev Number: 10 (DW_TAG_member)
    <984>   DW_AT_name        : (indirect string, offset: 0x58e05): AHB2LPENR
    <988>   DW_AT_decl_file   : 4
    <989>   DW_AT_decl_line   : 357
    <98b>   DW_AT_decl_column : 17
    <98c>   DW_AT_type        : <0x84b>
    <990>   DW_AT_data_member_location: 84
 <2><991>: Abbrev Number: 10 (DW_TAG_member)
    <992>   DW_AT_name        : (indirect string, offset: 0x65c90): AHB3LPENR
    <996>   DW_AT_decl_file   : 4
    <997>   DW_AT_decl_line   : 358
    <999>   DW_AT_decl_column : 17
    <99a>   DW_AT_type        : <0x84b>
    <99e>   DW_AT_data_member_location: 88
 <2><99f>: Abbrev Number: 10 (DW_TAG_member)
    <9a0>   DW_AT_name        : (indirect string, offset: 0x51cc2): RESERVED4
    <9a4>   DW_AT_decl_file   : 4
    <9a5>   DW_AT_decl_line   : 359
    <9a7>   DW_AT_decl_column : 17
    <9a8>   DW_AT_type        : <0x83f>
    <9ac>   DW_AT_data_member_location: 92
 <2><9ad>: Abbrev Number: 10 (DW_TAG_member)
    <9ae>   DW_AT_name        : (indirect string, offset: 0x67425): APB1LPENR
    <9b2>   DW_AT_decl_file   : 4
    <9b3>   DW_AT_decl_line   : 360
    <9b5>   DW_AT_decl_column : 17
    <9b6>   DW_AT_type        : <0x84b>
    <9ba>   DW_AT_data_member_location: 96
 <2><9bb>: Abbrev Number: 10 (DW_TAG_member)
    <9bc>   DW_AT_name        : (indirect string, offset: 0x7fb1e): APB2LPENR
    <9c0>   DW_AT_decl_file   : 4
    <9c1>   DW_AT_decl_line   : 361
    <9c3>   DW_AT_decl_column : 17
    <9c4>   DW_AT_type        : <0x84b>
    <9c8>   DW_AT_data_member_location: 100
 <2><9c9>: Abbrev Number: 10 (DW_TAG_member)
    <9ca>   DW_AT_name        : (indirect string, offset: 0x51ccc): RESERVED5
    <9ce>   DW_AT_decl_file   : 4
    <9cf>   DW_AT_decl_line   : 362
    <9d1>   DW_AT_decl_column : 17
    <9d2>   DW_AT_type        : <0x860>
    <9d6>   DW_AT_data_member_location: 104
 <2><9d7>: Abbrev Number: 10 (DW_TAG_member)
    <9d8>   DW_AT_name        : (indirect string, offset: 0x816ab): BDCR
    <9dc>   DW_AT_decl_file   : 4
    <9dd>   DW_AT_decl_line   : 363
    <9df>   DW_AT_decl_column : 17
    <9e0>   DW_AT_type        : <0x84b>
    <9e4>   DW_AT_data_member_location: 112
 <2><9e5>: Abbrev Number: 9 (DW_TAG_member)
    <9e6>   DW_AT_name        : CSR
    <9ea>   DW_AT_decl_file   : 4
    <9eb>   DW_AT_decl_line   : 364
    <9ed>   DW_AT_decl_column : 17
    <9ee>   DW_AT_type        : <0x84b>
    <9f2>   DW_AT_data_member_location: 116
 <2><9f3>: Abbrev Number: 10 (DW_TAG_member)
    <9f4>   DW_AT_name        : (indirect string, offset: 0x8fa4): RESERVED6
    <9f8>   DW_AT_decl_file   : 4
    <9f9>   DW_AT_decl_line   : 365
    <9fb>   DW_AT_decl_column : 17
    <9fc>   DW_AT_type        : <0x860>
    <a00>   DW_AT_data_member_location: 120
 <2><a01>: Abbrev Number: 10 (DW_TAG_member)
    <a02>   DW_AT_name        : (indirect string, offset: 0x6e48b): SSCGR
    <a06>   DW_AT_decl_file   : 4
    <a07>   DW_AT_decl_line   : 366
    <a09>   DW_AT_decl_column : 17
    <a0a>   DW_AT_type        : <0x84b>
    <a0e>   DW_AT_data_member_location: 128
 <2><a0f>: Abbrev Number: 10 (DW_TAG_member)
    <a10>   DW_AT_name        : (indirect string, offset: 0xd888): PLLI2SCFGR
    <a14>   DW_AT_decl_file   : 4
    <a15>   DW_AT_decl_line   : 367
    <a17>   DW_AT_decl_column : 17
    <a18>   DW_AT_type        : <0x84b>
    <a1c>   DW_AT_data_member_location: 132
 <2><a1d>: Abbrev Number: 10 (DW_TAG_member)
    <a1e>   DW_AT_name        : (indirect string, offset: 0x51d09): RESERVED7
    <a22>   DW_AT_decl_file   : 4
    <a23>   DW_AT_decl_line   : 368
    <a25>   DW_AT_decl_column : 17
    <a26>   DW_AT_type        : <0x850>
    <a2a>   DW_AT_data_member_location: 136
 <2><a2b>: Abbrev Number: 10 (DW_TAG_member)
    <a2c>   DW_AT_name        : (indirect string, offset: 0x64fe5): DCKCFGR
    <a30>   DW_AT_decl_file   : 4
    <a31>   DW_AT_decl_line   : 369
    <a33>   DW_AT_decl_column : 17
    <a34>   DW_AT_type        : <0x84b>
    <a38>   DW_AT_data_member_location: 140
 <2><a39>: Abbrev Number: 0
 <1><a3a>: Abbrev Number: 11 (DW_TAG_typedef)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x1aa91): RCC_TypeDef
    <a3f>   DW_AT_decl_file   : 4
    <a40>   DW_AT_decl_line   : 370
    <a42>   DW_AT_decl_column : 3
    <a43>   DW_AT_type        : <0x870>
 <1><a47>: Abbrev Number: 2 (DW_TAG_base_type)
    <a48>   DW_AT_byte_size   : 8
    <a49>   DW_AT_encoding    : 4	(float)
    <a4a>   DW_AT_name        : (indirect string, offset: 0x3ed91): long double
 <1><a4e>: Abbrev Number: 12 (DW_TAG_subprogram)
    <a4f>   DW_AT_external    : 1
    <a4f>   DW_AT_name        : (indirect string, offset: 0x81a36): HAL_MspInit
    <a53>   DW_AT_decl_file   : 1
    <a54>   DW_AT_decl_line   : 63
    <a55>   DW_AT_decl_column : 6
    <a56>   DW_AT_prototyped  : 1
    <a56>   DW_AT_low_pc      : 0x80007b8
    <a5a>   DW_AT_high_pc     : 0x50
    <a5e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a60>   DW_AT_GNU_all_call_sites: 1
 <2><a60>: Abbrev Number: 13 (DW_TAG_lexical_block)
    <a61>   DW_AT_low_pc      : 0x80007be
    <a65>   DW_AT_high_pc     : 0x1c
    <a69>   DW_AT_sibling     : <0xa7d>
 <3><a6d>: Abbrev Number: 14 (DW_TAG_variable)
    <a6e>   DW_AT_name        : (indirect string, offset: 0x69c5c): tmpreg
    <a72>   DW_AT_decl_file   : 1
    <a73>   DW_AT_decl_line   : 69
    <a74>   DW_AT_decl_column : 3
    <a75>   DW_AT_type        : <0x84b>
    <a79>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><a7c>: Abbrev Number: 0
 <2><a7d>: Abbrev Number: 15 (DW_TAG_lexical_block)
    <a7e>   DW_AT_low_pc      : 0x80007da
    <a82>   DW_AT_high_pc     : 0x1c
 <3><a86>: Abbrev Number: 14 (DW_TAG_variable)
    <a87>   DW_AT_name        : (indirect string, offset: 0x69c5c): tmpreg
    <a8b>   DW_AT_decl_file   : 1
    <a8c>   DW_AT_decl_line   : 70
    <a8d>   DW_AT_decl_column : 3
    <a8e>   DW_AT_type        : <0x84b>
    <a92>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><a95>: Abbrev Number: 0
 <2><a96>: Abbrev Number: 0
 <1><a97>: Abbrev Number: 0
  Compilation Unit @ offset 0xa98:
   Length:        0x11d (32-bit)
   Version:       4
   Abbrev Offset: 0x305
   Pointer Size:  4
 <0><aa3>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <aa4>   DW_AT_producer    : (indirect string, offset: 0x4c9bf): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <aa8>   DW_AT_language    : 12	(ANSI C99)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x81aa5): ../Core/Src/stm32f4xx_it.c
    <aad>   DW_AT_comp_dir    : (indirect string, offset: 0xca7): E:/Projects/Software/STM32/Lecture1/STM32_GPIO/Debug
    <ab1>   DW_AT_ranges      : 0x38
    <ab5>   DW_AT_low_pc      : 0x0
    <ab9>   DW_AT_stmt_list   : 0xfb5
    <abd>   DW_AT_GNU_macros  : 0x14472
 <1><ac1>: Abbrev Number: 2 (DW_TAG_base_type)
    <ac2>   DW_AT_byte_size   : 1
    <ac3>   DW_AT_encoding    : 6	(signed char)
    <ac4>   DW_AT_name        : (indirect string, offset: 0x60f91): signed char
 <1><ac8>: Abbrev Number: 2 (DW_TAG_base_type)
    <ac9>   DW_AT_byte_size   : 1
    <aca>   DW_AT_encoding    : 8	(unsigned char)
    <acb>   DW_AT_name        : (indirect string, offset: 0x5cfa3): unsigned char
 <1><acf>: Abbrev Number: 2 (DW_TAG_base_type)
    <ad0>   DW_AT_byte_size   : 2
    <ad1>   DW_AT_encoding    : 5	(signed)
    <ad2>   DW_AT_name        : (indirect string, offset: 0x5123): short int
 <1><ad6>: Abbrev Number: 2 (DW_TAG_base_type)
    <ad7>   DW_AT_byte_size   : 2
    <ad8>   DW_AT_encoding    : 7	(unsigned)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x41202): short unsigned int
 <1><add>: Abbrev Number: 2 (DW_TAG_base_type)
    <ade>   DW_AT_byte_size   : 4
    <adf>   DW_AT_encoding    : 5	(signed)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x1a077): long int
 <1><ae4>: Abbrev Number: 2 (DW_TAG_base_type)
    <ae5>   DW_AT_byte_size   : 4
    <ae6>   DW_AT_encoding    : 7	(unsigned)
    <ae7>   DW_AT_name        : (indirect string, offset: 0x4c75d): long unsigned int
 <1><aeb>: Abbrev Number: 2 (DW_TAG_base_type)
    <aec>   DW_AT_byte_size   : 8
    <aed>   DW_AT_encoding    : 5	(signed)
    <aee>   DW_AT_name        : (indirect string, offset: 0x338b6): long long int
 <1><af2>: Abbrev Number: 2 (DW_TAG_base_type)
    <af3>   DW_AT_byte_size   : 8
    <af4>   DW_AT_encoding    : 7	(unsigned)
    <af5>   DW_AT_name        : (indirect string, offset: 0x2c0fa): long long unsigned int
 <1><af9>: Abbrev Number: 3 (DW_TAG_base_type)
    <afa>   DW_AT_byte_size   : 4
    <afb>   DW_AT_encoding    : 5	(signed)
    <afc>   DW_AT_name        : int
 <1><b00>: Abbrev Number: 2 (DW_TAG_base_type)
    <b01>   DW_AT_byte_size   : 4
    <b02>   DW_AT_encoding    : 7	(unsigned)
    <b03>   DW_AT_name        : (indirect string, offset: 0x462ef): unsigned int
 <1><b07>: Abbrev Number: 2 (DW_TAG_base_type)
    <b08>   DW_AT_byte_size   : 8
    <b09>   DW_AT_encoding    : 4	(float)
    <b0a>   DW_AT_name        : (indirect string, offset: 0x3ed91): long double
 <1><b0e>: Abbrev Number: 4 (DW_TAG_subprogram)
    <b0f>   DW_AT_external    : 1
    <b0f>   DW_AT_name        : (indirect string, offset: 0x81ade): HAL_IncTick
    <b13>   DW_AT_decl_file   : 2
    <b14>   DW_AT_decl_line   : 232
    <b15>   DW_AT_decl_column : 6
    <b16>   DW_AT_prototyped  : 1
    <b16>   DW_AT_declaration : 1
 <1><b16>: Abbrev Number: 5 (DW_TAG_subprogram)
    <b17>   DW_AT_external    : 1
    <b17>   DW_AT_name        : (indirect string, offset: 0x81afb): SysTick_Handler
    <b1b>   DW_AT_decl_file   : 1
    <b1c>   DW_AT_decl_line   : 183
    <b1d>   DW_AT_decl_column : 6
    <b1e>   DW_AT_prototyped  : 1
    <b1e>   DW_AT_low_pc      : 0x8000850
    <b22>   DW_AT_high_pc     : 0xc
    <b26>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b28>   DW_AT_GNU_all_tail_call_sites: 1
 <1><b28>: Abbrev Number: 6 (DW_TAG_subprogram)
    <b29>   DW_AT_external    : 1
    <b29>   DW_AT_name        : (indirect string, offset: 0x81a8a): PendSV_Handler
    <b2d>   DW_AT_decl_file   : 1
    <b2e>   DW_AT_decl_line   : 170
    <b2f>   DW_AT_decl_column : 6
    <b30>   DW_AT_prototyped  : 1
    <b30>   DW_AT_low_pc      : 0x8000842
    <b34>   DW_AT_high_pc     : 0xe
    <b38>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b3a>   DW_AT_GNU_all_call_sites: 1
 <1><b3a>: Abbrev Number: 6 (DW_TAG_subprogram)
    <b3b>   DW_AT_external    : 1
    <b3b>   DW_AT_name        : (indirect string, offset: 0x81a79): DebugMon_Handler
    <b3f>   DW_AT_decl_file   : 1
    <b40>   DW_AT_decl_line   : 157
    <b41>   DW_AT_decl_column : 6
    <b42>   DW_AT_prototyped  : 1
    <b42>   DW_AT_low_pc      : 0x8000834
    <b46>   DW_AT_high_pc     : 0xe
    <b4a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b4c>   DW_AT_GNU_all_call_sites: 1
 <1><b4c>: Abbrev Number: 6 (DW_TAG_subprogram)
    <b4d>   DW_AT_external    : 1
    <b4d>   DW_AT_name        : (indirect string, offset: 0x81ad2): SVC_Handler
    <b51>   DW_AT_decl_file   : 1
    <b52>   DW_AT_decl_line   : 144
    <b53>   DW_AT_decl_column : 6
    <b54>   DW_AT_prototyped  : 1
    <b54>   DW_AT_low_pc      : 0x8000826
    <b58>   DW_AT_high_pc     : 0xe
    <b5c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b5e>   DW_AT_GNU_all_call_sites: 1
 <1><b5e>: Abbrev Number: 6 (DW_TAG_subprogram)
    <b5f>   DW_AT_external    : 1
    <b5f>   DW_AT_name        : (indirect string, offset: 0x81a42): UsageFault_Handler
    <b63>   DW_AT_decl_file   : 1
    <b64>   DW_AT_decl_line   : 129
    <b65>   DW_AT_decl_column : 6
    <b66>   DW_AT_prototyped  : 1
    <b66>   DW_AT_low_pc      : 0x8000820
    <b6a>   DW_AT_high_pc     : 0x6
    <b6e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b70>   DW_AT_GNU_all_call_sites: 1
 <1><b70>: Abbrev Number: 6 (DW_TAG_subprogram)
    <b71>   DW_AT_external    : 1
    <b71>   DW_AT_name        : (indirect string, offset: 0x81aea): BusFault_Handler
    <b75>   DW_AT_decl_file   : 1
    <b76>   DW_AT_decl_line   : 114
    <b77>   DW_AT_decl_column : 6
    <b78>   DW_AT_prototyped  : 1
    <b78>   DW_AT_low_pc      : 0x800081a
    <b7c>   DW_AT_high_pc     : 0x6
    <b80>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b82>   DW_AT_GNU_all_call_sites: 1
 <1><b82>: Abbrev Number: 6 (DW_TAG_subprogram)
    <b83>   DW_AT_external    : 1
    <b83>   DW_AT_name        : (indirect string, offset: 0x81ac0): MemManage_Handler
    <b87>   DW_AT_decl_file   : 1
    <b88>   DW_AT_decl_line   : 99
    <b89>   DW_AT_decl_column : 6
    <b8a>   DW_AT_prototyped  : 1
    <b8a>   DW_AT_low_pc      : 0x8000814
    <b8e>   DW_AT_high_pc     : 0x6
    <b92>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b94>   DW_AT_GNU_all_call_sites: 1
 <1><b94>: Abbrev Number: 6 (DW_TAG_subprogram)
    <b95>   DW_AT_external    : 1
    <b95>   DW_AT_name        : (indirect string, offset: 0x81a67): HardFault_Handler
    <b99>   DW_AT_decl_file   : 1
    <b9a>   DW_AT_decl_line   : 84
    <b9b>   DW_AT_decl_column : 6
    <b9c>   DW_AT_prototyped  : 1
    <b9c>   DW_AT_low_pc      : 0x800080e
    <ba0>   DW_AT_high_pc     : 0x6
    <ba4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ba6>   DW_AT_GNU_all_call_sites: 1
 <1><ba6>: Abbrev Number: 6 (DW_TAG_subprogram)
    <ba7>   DW_AT_external    : 1
    <ba7>   DW_AT_name        : (indirect string, offset: 0x81a99): NMI_Handler
    <bab>   DW_AT_decl_file   : 1
    <bac>   DW_AT_decl_line   : 69
    <bad>   DW_AT_decl_column : 6
    <bae>   DW_AT_prototyped  : 1
    <bae>   DW_AT_low_pc      : 0x8000808
    <bb2>   DW_AT_high_pc     : 0x6
    <bb6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bb8>   DW_AT_GNU_all_call_sites: 1
 <1><bb8>: Abbrev Number: 0
  Compilation Unit @ offset 0xbb9:
   Length:        0x16d (32-bit)
   Version:       4
   Abbrev Offset: 0x379
   Pointer Size:  4
 <0><bc4>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <bc5>   DW_AT_producer    : (indirect string, offset: 0x4c9bf): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <bc9>   DW_AT_language    : 12	(ANSI C99)
    <bca>   DW_AT_name        : (indirect string, offset: 0x81d68): ../Core/Src/sysmem.c
    <bce>   DW_AT_comp_dir    : (indirect string, offset: 0xca7): E:/Projects/Software/STM32/Lecture1/STM32_GPIO/Debug
    <bd2>   DW_AT_ranges      : 0x88
    <bd6>   DW_AT_low_pc      : 0x0
    <bda>   DW_AT_stmt_list   : 0x16f2
    <bde>   DW_AT_GNU_macros  : 0x14636
 <1><be2>: Abbrev Number: 2 (DW_TAG_base_type)
    <be3>   DW_AT_byte_size   : 4
    <be4>   DW_AT_encoding    : 5	(signed)
    <be5>   DW_AT_name        : int
 <1><be9>: Abbrev Number: 3 (DW_TAG_typedef)
    <bea>   DW_AT_name        : (indirect string, offset: 0x297d8): ptrdiff_t
    <bee>   DW_AT_decl_file   : 2
    <bef>   DW_AT_decl_line   : 143
    <bf0>   DW_AT_decl_column : 26
    <bf1>   DW_AT_type        : <0xbe2>
 <1><bf5>: Abbrev Number: 4 (DW_TAG_base_type)
    <bf6>   DW_AT_byte_size   : 4
    <bf7>   DW_AT_encoding    : 7	(unsigned)
    <bf8>   DW_AT_name        : (indirect string, offset: 0x462ef): unsigned int
 <1><bfc>: Abbrev Number: 4 (DW_TAG_base_type)
    <bfd>   DW_AT_byte_size   : 8
    <bfe>   DW_AT_encoding    : 5	(signed)
    <bff>   DW_AT_name        : (indirect string, offset: 0x338b6): long long int
 <1><c03>: Abbrev Number: 4 (DW_TAG_base_type)
    <c04>   DW_AT_byte_size   : 8
    <c05>   DW_AT_encoding    : 4	(float)
    <c06>   DW_AT_name        : (indirect string, offset: 0x3ed91): long double
 <1><c0a>: Abbrev Number: 4 (DW_TAG_base_type)
    <c0b>   DW_AT_byte_size   : 1
    <c0c>   DW_AT_encoding    : 6	(signed char)
    <c0d>   DW_AT_name        : (indirect string, offset: 0x60f91): signed char
 <1><c11>: Abbrev Number: 3 (DW_TAG_typedef)
    <c12>   DW_AT_name        : (indirect string, offset: 0x7b41): __uint8_t
    <c16>   DW_AT_decl_file   : 3
    <c17>   DW_AT_decl_line   : 43
    <c18>   DW_AT_decl_column : 24
    <c19>   DW_AT_type        : <0xc1d>
 <1><c1d>: Abbrev Number: 4 (DW_TAG_base_type)
    <c1e>   DW_AT_byte_size   : 1
    <c1f>   DW_AT_encoding    : 8	(unsigned char)
    <c20>   DW_AT_name        : (indirect string, offset: 0x5cfa3): unsigned char
 <1><c24>: Abbrev Number: 4 (DW_TAG_base_type)
    <c25>   DW_AT_byte_size   : 2
    <c26>   DW_AT_encoding    : 5	(signed)
    <c27>   DW_AT_name        : (indirect string, offset: 0x5123): short int
 <1><c2b>: Abbrev Number: 4 (DW_TAG_base_type)
    <c2c>   DW_AT_byte_size   : 2
    <c2d>   DW_AT_encoding    : 7	(unsigned)
    <c2e>   DW_AT_name        : (indirect string, offset: 0x41202): short unsigned int
 <1><c32>: Abbrev Number: 4 (DW_TAG_base_type)
    <c33>   DW_AT_byte_size   : 4
    <c34>   DW_AT_encoding    : 5	(signed)
    <c35>   DW_AT_name        : (indirect string, offset: 0x1a077): long int
 <1><c39>: Abbrev Number: 3 (DW_TAG_typedef)
    <c3a>   DW_AT_name        : (indirect string, offset: 0x38f02): __uint32_t
    <c3e>   DW_AT_decl_file   : 3
    <c3f>   DW_AT_decl_line   : 79
    <c40>   DW_AT_decl_column : 25
    <c41>   DW_AT_type        : <0xc45>
 <1><c45>: Abbrev Number: 4 (DW_TAG_base_type)
    <c46>   DW_AT_byte_size   : 4
    <c47>   DW_AT_encoding    : 7	(unsigned)
    <c48>   DW_AT_name        : (indirect string, offset: 0x4c75d): long unsigned int
 <1><c4c>: Abbrev Number: 4 (DW_TAG_base_type)
    <c4d>   DW_AT_byte_size   : 8
    <c4e>   DW_AT_encoding    : 7	(unsigned)
    <c4f>   DW_AT_name        : (indirect string, offset: 0x2c0fa): long long unsigned int
 <1><c53>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <c54>   DW_AT_byte_size   : 4
 <1><c55>: Abbrev Number: 4 (DW_TAG_base_type)
    <c56>   DW_AT_byte_size   : 1
    <c57>   DW_AT_encoding    : 8	(unsigned char)
    <c58>   DW_AT_name        : (indirect string, offset: 0x60f98): char
 <1><c5c>: Abbrev Number: 3 (DW_TAG_typedef)
    <c5d>   DW_AT_name        : (indirect string, offset: 0x7b43): uint8_t
    <c61>   DW_AT_decl_file   : 4
    <c62>   DW_AT_decl_line   : 24
    <c63>   DW_AT_decl_column : 19
    <c64>   DW_AT_type        : <0xc11>
 <1><c68>: Abbrev Number: 6 (DW_TAG_const_type)
    <c69>   DW_AT_type        : <0xc5c>
 <1><c6d>: Abbrev Number: 3 (DW_TAG_typedef)
    <c6e>   DW_AT_name        : (indirect string, offset: 0x38f04): uint32_t
    <c72>   DW_AT_decl_file   : 4
    <c73>   DW_AT_decl_line   : 48
    <c74>   DW_AT_decl_column : 20
    <c75>   DW_AT_type        : <0xc39>
 <1><c79>: Abbrev Number: 6 (DW_TAG_const_type)
    <c7a>   DW_AT_type        : <0xc6d>
 <1><c7e>: Abbrev Number: 7 (DW_TAG_variable)
    <c7f>   DW_AT_name        : (indirect string, offset: 0x81dee): __sbrk_heap_end
    <c83>   DW_AT_decl_file   : 1
    <c84>   DW_AT_decl_line   : 30
    <c85>   DW_AT_decl_column : 17
    <c86>   DW_AT_type        : <0xc90>
    <c8a>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><c90>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c91>   DW_AT_byte_size   : 4
    <c92>   DW_AT_type        : <0xc5c>
 <1><c96>: Abbrev Number: 9 (DW_TAG_subprogram)
    <c97>   DW_AT_external    : 1
    <c97>   DW_AT_name        : (indirect string, offset: 0x81bd3): __errno
    <c9b>   DW_AT_decl_file   : 5
    <c9c>   DW_AT_decl_line   : 15
    <c9d>   DW_AT_decl_column : 13
    <c9e>   DW_AT_prototyped  : 1
    <c9e>   DW_AT_type        : <0xca2>
    <ca2>   DW_AT_declaration : 1
 <1><ca2>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <ca3>   DW_AT_byte_size   : 4
    <ca4>   DW_AT_type        : <0xbe2>
 <1><ca8>: Abbrev Number: 10 (DW_TAG_subprogram)
    <ca9>   DW_AT_external    : 1
    <ca9>   DW_AT_name        : (indirect string, offset: 0x81d9f): _sbrk
    <cad>   DW_AT_decl_file   : 1
    <cae>   DW_AT_decl_line   : 53
    <caf>   DW_AT_decl_column : 7
    <cb0>   DW_AT_prototyped  : 1
    <cb0>   DW_AT_type        : <0xc53>
    <cb4>   DW_AT_low_pc      : 0x800085c
    <cb8>   DW_AT_high_pc     : 0x6c
    <cbc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cbe>   DW_AT_GNU_all_tail_call_sites: 1
    <cbe>   DW_AT_sibling     : <0xd23>
 <2><cc2>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <cc3>   DW_AT_name        : (indirect string, offset: 0x81e09): incr
    <cc7>   DW_AT_decl_file   : 1
    <cc8>   DW_AT_decl_line   : 53
    <cc9>   DW_AT_decl_column : 23
    <cca>   DW_AT_type        : <0xbe9>
    <cce>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><cd1>: Abbrev Number: 12 (DW_TAG_variable)
    <cd2>   DW_AT_name        : (indirect string, offset: 0x81df9): _end
    <cd6>   DW_AT_decl_file   : 1
    <cd7>   DW_AT_decl_line   : 55
    <cd8>   DW_AT_decl_column : 18
    <cd9>   DW_AT_type        : <0xc5c>
    <cdd>   DW_AT_external    : 1
    <cdd>   DW_AT_declaration : 1
 <2><cdd>: Abbrev Number: 12 (DW_TAG_variable)
    <cde>   DW_AT_name        : (indirect string, offset: 0x81e32): _estack
    <ce2>   DW_AT_decl_file   : 1
    <ce3>   DW_AT_decl_line   : 56
    <ce4>   DW_AT_decl_column : 18
    <ce5>   DW_AT_type        : <0xc5c>
    <ce9>   DW_AT_external    : 1
    <ce9>   DW_AT_declaration : 1
 <2><ce9>: Abbrev Number: 12 (DW_TAG_variable)
    <cea>   DW_AT_name        : (indirect string, offset: 0x81f03): _Min_Stack_Size
    <cee>   DW_AT_decl_file   : 1
    <cef>   DW_AT_decl_line   : 57
    <cf0>   DW_AT_decl_column : 19
    <cf1>   DW_AT_type        : <0xc6d>
    <cf5>   DW_AT_external    : 1
    <cf5>   DW_AT_declaration : 1
 <2><cf5>: Abbrev Number: 7 (DW_TAG_variable)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x81e8c): stack_limit
    <cfa>   DW_AT_decl_file   : 1
    <cfb>   DW_AT_decl_line   : 58
    <cfc>   DW_AT_decl_column : 18
    <cfd>   DW_AT_type        : <0xc79>
    <d01>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><d04>: Abbrev Number: 7 (DW_TAG_variable)
    <d05>   DW_AT_name        : (indirect string, offset: 0x81c6e): max_heap
    <d09>   DW_AT_decl_file   : 1
    <d0a>   DW_AT_decl_line   : 59
    <d0b>   DW_AT_decl_column : 18
    <d0c>   DW_AT_type        : <0xd23>
    <d10>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><d13>: Abbrev Number: 7 (DW_TAG_variable)
    <d14>   DW_AT_name        : (indirect string, offset: 0x81f48): prev_heap_end
    <d18>   DW_AT_decl_file   : 1
    <d19>   DW_AT_decl_line   : 60
    <d1a>   DW_AT_decl_column : 12
    <d1b>   DW_AT_type        : <0xc90>
    <d1f>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><d22>: Abbrev Number: 0
 <1><d23>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d24>   DW_AT_byte_size   : 4
    <d25>   DW_AT_type        : <0xc68>
 <1><d29>: Abbrev Number: 0
  Compilation Unit @ offset 0xd2a:
   Length:        0x54b (32-bit)
   Version:       4
   Abbrev Offset: 0x434
   Pointer Size:  4
 <0><d35>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <d36>   DW_AT_producer    : (indirect string, offset: 0x4c9bf): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <d3a>   DW_AT_language    : 12	(ANSI C99)
    <d3b>   DW_AT_name        : (indirect string, offset: 0x81ff4): ../Core/Src/system_stm32f4xx.c
    <d3f>   DW_AT_comp_dir    : (indirect string, offset: 0xca7): E:/Projects/Software/STM32/Lecture1/STM32_GPIO/Debug
    <d43>   DW_AT_ranges      : 0x98
    <d47>   DW_AT_low_pc      : 0x0
    <d4b>   DW_AT_stmt_list   : 0x1be6
    <d4f>   DW_AT_GNU_macros  : 0x14ab7
 <1><d53>: Abbrev Number: 2 (DW_TAG_base_type)
    <d54>   DW_AT_byte_size   : 1
    <d55>   DW_AT_encoding    : 6	(signed char)
    <d56>   DW_AT_name        : (indirect string, offset: 0x60f91): signed char
 <1><d5a>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5b>   DW_AT_name        : (indirect string, offset: 0x7b41): __uint8_t
    <d5f>   DW_AT_decl_file   : 2
    <d60>   DW_AT_decl_line   : 43
    <d61>   DW_AT_decl_column : 24
    <d62>   DW_AT_type        : <0xd66>
 <1><d66>: Abbrev Number: 2 (DW_TAG_base_type)
    <d67>   DW_AT_byte_size   : 1
    <d68>   DW_AT_encoding    : 8	(unsigned char)
    <d69>   DW_AT_name        : (indirect string, offset: 0x5cfa3): unsigned char
 <1><d6d>: Abbrev Number: 2 (DW_TAG_base_type)
    <d6e>   DW_AT_byte_size   : 2
    <d6f>   DW_AT_encoding    : 5	(signed)
    <d70>   DW_AT_name        : (indirect string, offset: 0x5123): short int
 <1><d74>: Abbrev Number: 2 (DW_TAG_base_type)
    <d75>   DW_AT_byte_size   : 2
    <d76>   DW_AT_encoding    : 7	(unsigned)
    <d77>   DW_AT_name        : (indirect string, offset: 0x41202): short unsigned int
 <1><d7b>: Abbrev Number: 2 (DW_TAG_base_type)
    <d7c>   DW_AT_byte_size   : 4
    <d7d>   DW_AT_encoding    : 5	(signed)
    <d7e>   DW_AT_name        : (indirect string, offset: 0x1a077): long int
 <1><d82>: Abbrev Number: 3 (DW_TAG_typedef)
    <d83>   DW_AT_name        : (indirect string, offset: 0x38f02): __uint32_t
    <d87>   DW_AT_decl_file   : 2
    <d88>   DW_AT_decl_line   : 79
    <d89>   DW_AT_decl_column : 25
    <d8a>   DW_AT_type        : <0xd8e>
 <1><d8e>: Abbrev Number: 2 (DW_TAG_base_type)
    <d8f>   DW_AT_byte_size   : 4
    <d90>   DW_AT_encoding    : 7	(unsigned)
    <d91>   DW_AT_name        : (indirect string, offset: 0x4c75d): long unsigned int
 <1><d95>: Abbrev Number: 2 (DW_TAG_base_type)
    <d96>   DW_AT_byte_size   : 8
    <d97>   DW_AT_encoding    : 5	(signed)
    <d98>   DW_AT_name        : (indirect string, offset: 0x338b6): long long int
 <1><d9c>: Abbrev Number: 2 (DW_TAG_base_type)
    <d9d>   DW_AT_byte_size   : 8
    <d9e>   DW_AT_encoding    : 7	(unsigned)
    <d9f>   DW_AT_name        : (indirect string, offset: 0x2c0fa): long long unsigned int
 <1><da3>: Abbrev Number: 4 (DW_TAG_base_type)
    <da4>   DW_AT_byte_size   : 4
    <da5>   DW_AT_encoding    : 5	(signed)
    <da6>   DW_AT_name        : int
 <1><daa>: Abbrev Number: 2 (DW_TAG_base_type)
    <dab>   DW_AT_byte_size   : 4
    <dac>   DW_AT_encoding    : 7	(unsigned)
    <dad>   DW_AT_name        : (indirect string, offset: 0x462ef): unsigned int
 <1><db1>: Abbrev Number: 3 (DW_TAG_typedef)
    <db2>   DW_AT_name        : (indirect string, offset: 0x7b43): uint8_t
    <db6>   DW_AT_decl_file   : 3
    <db7>   DW_AT_decl_line   : 24
    <db8>   DW_AT_decl_column : 19
    <db9>   DW_AT_type        : <0xd5a>
 <1><dbd>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <dbe>   DW_AT_type        : <0xdb1>
 <1><dc2>: Abbrev Number: 6 (DW_TAG_const_type)
    <dc3>   DW_AT_type        : <0xdb1>
 <1><dc7>: Abbrev Number: 3 (DW_TAG_typedef)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x38f04): uint32_t
    <dcc>   DW_AT_decl_file   : 3
    <dcd>   DW_AT_decl_line   : 48
    <dce>   DW_AT_decl_column : 20
    <dcf>   DW_AT_type        : <0xd82>
 <1><dd3>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <dd4>   DW_AT_type        : <0xdc7>
 <1><dd8>: Abbrev Number: 6 (DW_TAG_const_type)
    <dd9>   DW_AT_type        : <0xdd3>
 <1><ddd>: Abbrev Number: 7 (DW_TAG_structure_type)
    <dde>   DW_AT_byte_size   : 140
    <ddf>   DW_AT_decl_file   : 4
    <de0>   DW_AT_decl_line   : 440
    <de2>   DW_AT_decl_column : 9
    <de3>   DW_AT_sibling     : <0xf0e>
 <2><de7>: Abbrev Number: 8 (DW_TAG_member)
    <de8>   DW_AT_name        : (indirect string, offset: 0x82066): CPUID
    <dec>   DW_AT_decl_file   : 4
    <ded>   DW_AT_decl_line   : 442
    <def>   DW_AT_decl_column : 18
    <df0>   DW_AT_type        : <0xdd8>
    <df4>   DW_AT_data_member_location: 0
 <2><df5>: Abbrev Number: 8 (DW_TAG_member)
    <df6>   DW_AT_name        : (indirect string, offset: 0x8209d): ICSR
    <dfa>   DW_AT_decl_file   : 4
    <dfb>   DW_AT_decl_line   : 443
    <dfd>   DW_AT_decl_column : 18
    <dfe>   DW_AT_type        : <0xdd3>
    <e02>   DW_AT_data_member_location: 4
 <2><e03>: Abbrev Number: 8 (DW_TAG_member)
    <e04>   DW_AT_name        : (indirect string, offset: 0x82018): VTOR
    <e08>   DW_AT_decl_file   : 4
    <e09>   DW_AT_decl_line   : 444
    <e0b>   DW_AT_decl_column : 18
    <e0c>   DW_AT_type        : <0xdd3>
    <e10>   DW_AT_data_member_location: 8
 <2><e11>: Abbrev Number: 8 (DW_TAG_member)
    <e12>   DW_AT_name        : (indirect string, offset: 0x820a7): AIRCR
    <e16>   DW_AT_decl_file   : 4
    <e17>   DW_AT_decl_line   : 445
    <e19>   DW_AT_decl_column : 18
    <e1a>   DW_AT_type        : <0xdd3>
    <e1e>   DW_AT_data_member_location: 12
 <2><e1f>: Abbrev Number: 9 (DW_TAG_member)
    <e20>   DW_AT_name        : SCR
    <e24>   DW_AT_decl_file   : 4
    <e25>   DW_AT_decl_line   : 446
    <e27>   DW_AT_decl_column : 18
    <e28>   DW_AT_type        : <0xdd3>
    <e2c>   DW_AT_data_member_location: 16
 <2><e2d>: Abbrev Number: 9 (DW_TAG_member)
    <e2e>   DW_AT_name        : CCR
    <e32>   DW_AT_decl_file   : 4
    <e33>   DW_AT_decl_line   : 447
    <e35>   DW_AT_decl_column : 18
    <e36>   DW_AT_type        : <0xdd3>
    <e3a>   DW_AT_data_member_location: 20
 <2><e3b>: Abbrev Number: 9 (DW_TAG_member)
    <e3c>   DW_AT_name        : SHP
    <e40>   DW_AT_decl_file   : 4
    <e41>   DW_AT_decl_line   : 448
    <e43>   DW_AT_decl_column : 18
    <e44>   DW_AT_type        : <0xf1e>
    <e48>   DW_AT_data_member_location: 24
 <2><e49>: Abbrev Number: 8 (DW_TAG_member)
    <e4a>   DW_AT_name        : (indirect string, offset: 0x82032): SHCSR
    <e4e>   DW_AT_decl_file   : 4
    <e4f>   DW_AT_decl_line   : 449
    <e51>   DW_AT_decl_column : 18
    <e52>   DW_AT_type        : <0xdd3>
    <e56>   DW_AT_data_member_location: 36
 <2><e57>: Abbrev Number: 8 (DW_TAG_member)
    <e58>   DW_AT_name        : (indirect string, offset: 0x82052): CFSR
    <e5c>   DW_AT_decl_file   : 4
    <e5d>   DW_AT_decl_line   : 450
    <e5f>   DW_AT_decl_column : 18
    <e60>   DW_AT_type        : <0xdd3>
    <e64>   DW_AT_data_member_location: 40
 <2><e65>: Abbrev Number: 8 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0x82046): HFSR
    <e6a>   DW_AT_decl_file   : 4
    <e6b>   DW_AT_decl_line   : 451
    <e6d>   DW_AT_decl_column : 18
    <e6e>   DW_AT_type        : <0xdd3>
    <e72>   DW_AT_data_member_location: 44
 <2><e73>: Abbrev Number: 8 (DW_TAG_member)
    <e74>   DW_AT_name        : (indirect string, offset: 0x820a2): DFSR
    <e78>   DW_AT_decl_file   : 4
    <e79>   DW_AT_decl_line   : 452
    <e7b>   DW_AT_decl_column : 18
    <e7c>   DW_AT_type        : <0xdd3>
    <e80>   DW_AT_data_member_location: 48
 <2><e81>: Abbrev Number: 8 (DW_TAG_member)
    <e82>   DW_AT_name        : (indirect string, offset: 0x82060): MMFAR
    <e86>   DW_AT_decl_file   : 4
    <e87>   DW_AT_decl_line   : 453
    <e89>   DW_AT_decl_column : 18
    <e8a>   DW_AT_type        : <0xdd3>
    <e8e>   DW_AT_data_member_location: 52
 <2><e8f>: Abbrev Number: 8 (DW_TAG_member)
    <e90>   DW_AT_name        : (indirect string, offset: 0x81fe5): BFAR
    <e94>   DW_AT_decl_file   : 4
    <e95>   DW_AT_decl_line   : 454
    <e97>   DW_AT_decl_column : 18
    <e98>   DW_AT_type        : <0xdd3>
    <e9c>   DW_AT_data_member_location: 56
 <2><e9d>: Abbrev Number: 8 (DW_TAG_member)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x82098): AFSR
    <ea2>   DW_AT_decl_file   : 4
    <ea3>   DW_AT_decl_line   : 455
    <ea5>   DW_AT_decl_column : 18
    <ea6>   DW_AT_type        : <0xdd3>
    <eaa>   DW_AT_data_member_location: 60
 <2><eab>: Abbrev Number: 9 (DW_TAG_member)
    <eac>   DW_AT_name        : PFR
    <eb0>   DW_AT_decl_file   : 4
    <eb1>   DW_AT_decl_line   : 456
    <eb3>   DW_AT_decl_column : 18
    <eb4>   DW_AT_type        : <0xf38>
    <eb8>   DW_AT_data_member_location: 64
 <2><eb9>: Abbrev Number: 9 (DW_TAG_member)
    <eba>   DW_AT_name        : DFR
    <ebe>   DW_AT_decl_file   : 4
    <ebf>   DW_AT_decl_line   : 457
    <ec1>   DW_AT_decl_column : 18
    <ec2>   DW_AT_type        : <0xdd8>
    <ec6>   DW_AT_data_member_location: 72
 <2><ec7>: Abbrev Number: 9 (DW_TAG_member)
    <ec8>   DW_AT_name        : ADR
    <ecc>   DW_AT_decl_file   : 4
    <ecd>   DW_AT_decl_line   : 458
    <ecf>   DW_AT_decl_column : 18
    <ed0>   DW_AT_type        : <0xdd8>
    <ed4>   DW_AT_data_member_location: 76
 <2><ed5>: Abbrev Number: 8 (DW_TAG_member)
    <ed6>   DW_AT_name        : (indirect string, offset: 0x820bb): MMFR
    <eda>   DW_AT_decl_file   : 4
    <edb>   DW_AT_decl_line   : 459
    <edd>   DW_AT_decl_column : 18
    <ede>   DW_AT_type        : <0xf52>
    <ee2>   DW_AT_data_member_location: 80
 <2><ee3>: Abbrev Number: 8 (DW_TAG_member)
    <ee4>   DW_AT_name        : (indirect string, offset: 0x82013): ISAR
    <ee8>   DW_AT_decl_file   : 4
    <ee9>   DW_AT_decl_line   : 460
    <eeb>   DW_AT_decl_column : 18
    <eec>   DW_AT_type        : <0xf6c>
    <ef0>   DW_AT_data_member_location: 96
 <2><ef1>: Abbrev Number: 8 (DW_TAG_member)
    <ef2>   DW_AT_name        : (indirect string, offset: 0xf867): RESERVED0
    <ef6>   DW_AT_decl_file   : 4
    <ef7>   DW_AT_decl_line   : 461
    <ef9>   DW_AT_decl_column : 18
    <efa>   DW_AT_type        : <0xf71>
    <efe>   DW_AT_data_member_location: 116
 <2><eff>: Abbrev Number: 8 (DW_TAG_member)
    <f00>   DW_AT_name        : (indirect string, offset: 0x82092): CPACR
    <f04>   DW_AT_decl_file   : 4
    <f05>   DW_AT_decl_line   : 462
    <f07>   DW_AT_decl_column : 18
    <f08>   DW_AT_type        : <0xdd3>
    <f0c>   DW_AT_data_member_location: 136
 <2><f0d>: Abbrev Number: 0
 <1><f0e>: Abbrev Number: 10 (DW_TAG_array_type)
    <f0f>   DW_AT_type        : <0xdbd>
    <f13>   DW_AT_sibling     : <0xf1e>
 <2><f17>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <f18>   DW_AT_type        : <0xdaa>
    <f1c>   DW_AT_upper_bound : 11
 <2><f1d>: Abbrev Number: 0
 <1><f1e>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <f1f>   DW_AT_type        : <0xf0e>
 <1><f23>: Abbrev Number: 10 (DW_TAG_array_type)
    <f24>   DW_AT_type        : <0xdd8>
    <f28>   DW_AT_sibling     : <0xf33>
 <2><f2c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <f2d>   DW_AT_type        : <0xdaa>
    <f31>   DW_AT_upper_bound : 1
 <2><f32>: Abbrev Number: 0
 <1><f33>: Abbrev Number: 6 (DW_TAG_const_type)
    <f34>   DW_AT_type        : <0xf23>
 <1><f38>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <f39>   DW_AT_type        : <0xf33>
 <1><f3d>: Abbrev Number: 10 (DW_TAG_array_type)
    <f3e>   DW_AT_type        : <0xdd8>
    <f42>   DW_AT_sibling     : <0xf4d>
 <2><f46>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <f47>   DW_AT_type        : <0xdaa>
    <f4b>   DW_AT_upper_bound : 3
 <2><f4c>: Abbrev Number: 0
 <1><f4d>: Abbrev Number: 6 (DW_TAG_const_type)
    <f4e>   DW_AT_type        : <0xf3d>
 <1><f52>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <f53>   DW_AT_type        : <0xf4d>
 <1><f57>: Abbrev Number: 10 (DW_TAG_array_type)
    <f58>   DW_AT_type        : <0xdd8>
    <f5c>   DW_AT_sibling     : <0xf67>
 <2><f60>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <f61>   DW_AT_type        : <0xdaa>
    <f65>   DW_AT_upper_bound : 4
 <2><f66>: Abbrev Number: 0
 <1><f67>: Abbrev Number: 6 (DW_TAG_const_type)
    <f68>   DW_AT_type        : <0xf57>
 <1><f6c>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <f6d>   DW_AT_type        : <0xf67>
 <1><f71>: Abbrev Number: 10 (DW_TAG_array_type)
    <f72>   DW_AT_type        : <0xdc7>
    <f76>   DW_AT_sibling     : <0xf81>
 <2><f7a>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <f7b>   DW_AT_type        : <0xdaa>
    <f7f>   DW_AT_upper_bound : 4
 <2><f80>: Abbrev Number: 0
 <1><f81>: Abbrev Number: 12 (DW_TAG_typedef)
    <f82>   DW_AT_name        : (indirect string, offset: 0x82057): SCB_Type
    <f86>   DW_AT_decl_file   : 4
    <f87>   DW_AT_decl_line   : 463
    <f89>   DW_AT_decl_column : 3
    <f8a>   DW_AT_type        : <0xddd>
 <1><f8e>: Abbrev Number: 10 (DW_TAG_array_type)
    <f8f>   DW_AT_type        : <0xdc7>
    <f93>   DW_AT_sibling     : <0xf9e>
 <2><f97>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <f98>   DW_AT_type        : <0xdaa>
    <f9c>   DW_AT_upper_bound : 0
 <2><f9d>: Abbrev Number: 0
 <1><f9e>: Abbrev Number: 10 (DW_TAG_array_type)
    <f9f>   DW_AT_type        : <0xdc7>
    <fa3>   DW_AT_sibling     : <0xfae>
 <2><fa7>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <fa8>   DW_AT_type        : <0xdaa>
    <fac>   DW_AT_upper_bound : 1
 <2><fad>: Abbrev Number: 0
 <1><fae>: Abbrev Number: 13 (DW_TAG_variable)
    <faf>   DW_AT_name        : (indirect string, offset: 0x82082): SystemCoreClock
    <fb3>   DW_AT_decl_file   : 5
    <fb4>   DW_AT_decl_line   : 57
    <fb5>   DW_AT_decl_column : 17
    <fb6>   DW_AT_type        : <0xdc7>
    <fba>   DW_AT_external    : 1
    <fba>   DW_AT_declaration : 1
 <1><fba>: Abbrev Number: 10 (DW_TAG_array_type)
    <fbb>   DW_AT_type        : <0xdc2>
    <fbf>   DW_AT_sibling     : <0xfca>
 <2><fc3>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <fc4>   DW_AT_type        : <0xdaa>
    <fc8>   DW_AT_upper_bound : 15
 <2><fc9>: Abbrev Number: 0
 <1><fca>: Abbrev Number: 6 (DW_TAG_const_type)
    <fcb>   DW_AT_type        : <0xfba>
 <1><fcf>: Abbrev Number: 13 (DW_TAG_variable)
    <fd0>   DW_AT_name        : (indirect string, offset: 0x82038): AHBPrescTable
    <fd4>   DW_AT_decl_file   : 5
    <fd5>   DW_AT_decl_line   : 59
    <fd6>   DW_AT_decl_column : 23
    <fd7>   DW_AT_type        : <0xfca>
    <fdb>   DW_AT_external    : 1
    <fdb>   DW_AT_declaration : 1
 <1><fdb>: Abbrev Number: 10 (DW_TAG_array_type)
    <fdc>   DW_AT_type        : <0xdc2>
    <fe0>   DW_AT_sibling     : <0xfeb>
 <2><fe4>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <fe5>   DW_AT_type        : <0xdaa>
    <fe9>   DW_AT_upper_bound : 7
 <2><fea>: Abbrev Number: 0
 <1><feb>: Abbrev Number: 6 (DW_TAG_const_type)
    <fec>   DW_AT_type        : <0xfdb>
 <1><ff0>: Abbrev Number: 13 (DW_TAG_variable)
    <ff1>   DW_AT_name        : (indirect string, offset: 0x820ad): APBPrescTable
    <ff5>   DW_AT_decl_file   : 5
    <ff6>   DW_AT_decl_line   : 60
    <ff7>   DW_AT_decl_column : 23
    <ff8>   DW_AT_type        : <0xfeb>
    <ffc>   DW_AT_external    : 1
    <ffc>   DW_AT_declaration : 1
 <1><ffc>: Abbrev Number: 7 (DW_TAG_structure_type)
    <ffd>   DW_AT_byte_size   : 144
    <ffe>   DW_AT_decl_file   : 6
    <fff>   DW_AT_decl_line   : 336
    <1001>   DW_AT_decl_column : 9
    <1002>   DW_AT_sibling     : <0x11c6>
 <2><1006>: Abbrev Number: 9 (DW_TAG_member)
    <1007>   DW_AT_name        : CR
    <100a>   DW_AT_decl_file   : 6
    <100b>   DW_AT_decl_line   : 338
    <100d>   DW_AT_decl_column : 17
    <100e>   DW_AT_type        : <0xdd3>
    <1012>   DW_AT_data_member_location: 0
 <2><1013>: Abbrev Number: 8 (DW_TAG_member)
    <1014>   DW_AT_name        : (indirect string, offset: 0x35363): PLLCFGR
    <1018>   DW_AT_decl_file   : 6
    <1019>   DW_AT_decl_line   : 339
    <101b>   DW_AT_decl_column : 17
    <101c>   DW_AT_type        : <0xdd3>
    <1020>   DW_AT_data_member_location: 4
 <2><1021>: Abbrev Number: 8 (DW_TAG_member)
    <1022>   DW_AT_name        : (indirect string, offset: 0x64fe8): CFGR
    <1026>   DW_AT_decl_file   : 6
    <1027>   DW_AT_decl_line   : 340
    <1029>   DW_AT_decl_column : 17
    <102a>   DW_AT_type        : <0xdd3>
    <102e>   DW_AT_data_member_location: 8
 <2><102f>: Abbrev Number: 9 (DW_TAG_member)
    <1030>   DW_AT_name        : CIR
    <1034>   DW_AT_decl_file   : 6
    <1035>   DW_AT_decl_line   : 341
    <1037>   DW_AT_decl_column : 17
    <1038>   DW_AT_type        : <0xdd3>
    <103c>   DW_AT_data_member_location: 12
 <2><103d>: Abbrev Number: 8 (DW_TAG_member)
    <103e>   DW_AT_name        : (indirect string, offset: 0x5578c): AHB1RSTR
    <1042>   DW_AT_decl_file   : 6
    <1043>   DW_AT_decl_line   : 342
    <1045>   DW_AT_decl_column : 17
    <1046>   DW_AT_type        : <0xdd3>
    <104a>   DW_AT_data_member_location: 16
 <2><104b>: Abbrev Number: 8 (DW_TAG_member)
    <104c>   DW_AT_name        : (indirect string, offset: 0x69e72): AHB2RSTR
    <1050>   DW_AT_decl_file   : 6
    <1051>   DW_AT_decl_line   : 343
    <1053>   DW_AT_decl_column : 17
    <1054>   DW_AT_type        : <0xdd3>
    <1058>   DW_AT_data_member_location: 20
 <2><1059>: Abbrev Number: 8 (DW_TAG_member)
    <105a>   DW_AT_name        : (indirect string, offset: 0x7e965): AHB3RSTR
    <105e>   DW_AT_decl_file   : 6
    <105f>   DW_AT_decl_line   : 344
    <1061>   DW_AT_decl_column : 17
    <1062>   DW_AT_type        : <0xdd3>
    <1066>   DW_AT_data_member_location: 24
 <2><1067>: Abbrev Number: 8 (DW_TAG_member)
    <1068>   DW_AT_name        : (indirect string, offset: 0xf867): RESERVED0
    <106c>   DW_AT_decl_file   : 6
    <106d>   DW_AT_decl_line   : 345
    <106f>   DW_AT_decl_column : 17
    <1070>   DW_AT_type        : <0xdc7>
    <1074>   DW_AT_data_member_location: 28
 <2><1075>: Abbrev Number: 8 (DW_TAG_member)
    <1076>   DW_AT_name        : (indirect string, offset: 0x1979e): APB1RSTR
    <107a>   DW_AT_decl_file   : 6
    <107b>   DW_AT_decl_line   : 346
    <107d>   DW_AT_decl_column : 17
    <107e>   DW_AT_type        : <0xdd3>
    <1082>   DW_AT_data_member_location: 32
 <2><1083>: Abbrev Number: 8 (DW_TAG_member)
    <1084>   DW_AT_name        : (indirect string, offset: 0xadd2): APB2RSTR
    <1088>   DW_AT_decl_file   : 6
    <1089>   DW_AT_decl_line   : 347
    <108b>   DW_AT_decl_column : 17
    <108c>   DW_AT_type        : <0xdd3>
    <1090>   DW_AT_data_member_location: 36
 <2><1091>: Abbrev Number: 8 (DW_TAG_member)
    <1092>   DW_AT_name        : (indirect string, offset: 0xf88c): RESERVED1
    <1096>   DW_AT_decl_file   : 6
    <1097>   DW_AT_decl_line   : 348
    <1099>   DW_AT_decl_column : 17
    <109a>   DW_AT_type        : <0xf9e>
    <109e>   DW_AT_data_member_location: 40
 <2><109f>: Abbrev Number: 8 (DW_TAG_member)
    <10a0>   DW_AT_name        : (indirect string, offset: 0x67dda): AHB1ENR
    <10a4>   DW_AT_decl_file   : 6
    <10a5>   DW_AT_decl_line   : 349
    <10a7>   DW_AT_decl_column : 17
    <10a8>   DW_AT_type        : <0xdd3>
    <10ac>   DW_AT_data_member_location: 48
 <2><10ad>: Abbrev Number: 8 (DW_TAG_member)
    <10ae>   DW_AT_name        : (indirect string, offset: 0x16503): AHB2ENR
    <10b2>   DW_AT_decl_file   : 6
    <10b3>   DW_AT_decl_line   : 350
    <10b5>   DW_AT_decl_column : 17
    <10b6>   DW_AT_type        : <0xdd3>
    <10ba>   DW_AT_data_member_location: 52
 <2><10bb>: Abbrev Number: 8 (DW_TAG_member)
    <10bc>   DW_AT_name        : (indirect string, offset: 0x14a0): AHB3ENR
    <10c0>   DW_AT_decl_file   : 6
    <10c1>   DW_AT_decl_line   : 351
    <10c3>   DW_AT_decl_column : 17
    <10c4>   DW_AT_type        : <0xdd3>
    <10c8>   DW_AT_data_member_location: 56
 <2><10c9>: Abbrev Number: 8 (DW_TAG_member)
    <10ca>   DW_AT_name        : (indirect string, offset: 0x51cae): RESERVED2
    <10ce>   DW_AT_decl_file   : 6
    <10cf>   DW_AT_decl_line   : 352
    <10d1>   DW_AT_decl_column : 17
    <10d2>   DW_AT_type        : <0xdc7>
    <10d6>   DW_AT_data_member_location: 60
 <2><10d7>: Abbrev Number: 8 (DW_TAG_member)
    <10d8>   DW_AT_name        : (indirect string, offset: 0x257ca): APB1ENR
    <10dc>   DW_AT_decl_file   : 6
    <10dd>   DW_AT_decl_line   : 353
    <10df>   DW_AT_decl_column : 17
    <10e0>   DW_AT_type        : <0xdd3>
    <10e4>   DW_AT_data_member_location: 64
 <2><10e5>: Abbrev Number: 8 (DW_TAG_member)
    <10e6>   DW_AT_name        : (indirect string, offset: 0x52bdc): APB2ENR
    <10ea>   DW_AT_decl_file   : 6
    <10eb>   DW_AT_decl_line   : 354
    <10ed>   DW_AT_decl_column : 17
    <10ee>   DW_AT_type        : <0xdd3>
    <10f2>   DW_AT_data_member_location: 68
 <2><10f3>: Abbrev Number: 8 (DW_TAG_member)
    <10f4>   DW_AT_name        : (indirect string, offset: 0x51cb8): RESERVED3
    <10f8>   DW_AT_decl_file   : 6
    <10f9>   DW_AT_decl_line   : 355
    <10fb>   DW_AT_decl_column : 17
    <10fc>   DW_AT_type        : <0xf9e>
    <1100>   DW_AT_data_member_location: 72
 <2><1101>: Abbrev Number: 8 (DW_TAG_member)
    <1102>   DW_AT_name        : (indirect string, offset: 0x25490): AHB1LPENR
    <1106>   DW_AT_decl_file   : 6
    <1107>   DW_AT_decl_line   : 356
    <1109>   DW_AT_decl_column : 17
    <110a>   DW_AT_type        : <0xdd3>
    <110e>   DW_AT_data_member_location: 80
 <2><110f>: Abbrev Number: 8 (DW_TAG_member)
    <1110>   DW_AT_name        : (indirect string, offset: 0x58e05): AHB2LPENR
    <1114>   DW_AT_decl_file   : 6
    <1115>   DW_AT_decl_line   : 357
    <1117>   DW_AT_decl_column : 17
    <1118>   DW_AT_type        : <0xdd3>
    <111c>   DW_AT_data_member_location: 84
 <2><111d>: Abbrev Number: 8 (DW_TAG_member)
    <111e>   DW_AT_name        : (indirect string, offset: 0x65c90): AHB3LPENR
    <1122>   DW_AT_decl_file   : 6
    <1123>   DW_AT_decl_line   : 358
    <1125>   DW_AT_decl_column : 17
